using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace WindowsFormsApp1
{
    public partial class Form2 : Form
    {
        public Form2()
        {
            InitializeComponent();
            WindowState = FormWindowState.Maximized;
        }
        private void Form2_Load(object sender, EventArgs e)
        {
            checkBox1.Visible = false;
            checkBox2.Visible = false;
            checkBox3.Visible = false;
            checkBox4.Visible = false;
            checkBox5.Visible = false;
            checkBox6.Visible = false;
            checkBox7.Visible = false;
            checkBox8.Visible = false;
            checkBox9.Visible = false;
            checkBox10.Visible = false;
            checkBox11.Visible = false;
            checkBox12.Visible = false;
            checkBox13.Visible = false;
            checkBox14.Visible = false;
            checkBox15.Visible = false;
            checkBox16.Visible = false;
           

        }

        private void button12_Click(object sender, EventArgs e)
        {
            textBox1.Text = "";
            checkBox1.Visible = true;
            checkBox2.Visible = true;
            checkBox3.Visible = true;
            checkBox4.Visible = true;
            checkBox5.Visible = true;
            checkBox6.Visible = true;
            checkBox7.Visible = true;
            checkBox8.Visible = true;
            checkBox9.Visible = true;
            checkBox10.Visible = true;
            checkBox11.Visible = true;
            checkBox12.Visible = true;
            checkBox13.Visible = true;
            checkBox14.Visible = true;
            checkBox15.Visible = true;
            checkBox16.Visible = true;
            
        }

        private void button13_Click(object sender, EventArgs e)
        {
            textBox1.Text = "";
            if (checkBox1.Checked == true)
                one();
            if (checkBox2.Checked == true)
                two();
            if (checkBox3.Checked == true)
                three();
            if (checkBox4.Checked == true)
                four();
            if (checkBox5.Checked == true)
                five();
            if (checkBox6.Checked == true)
                sixth();
            if (checkBox7.Checked == true)
                seven();
            if (checkBox8.Checked == true)
                eight();
            if (checkBox9.Checked == true)
                nine();
            if (checkBox10.Checked == true)
                ten();
            if (checkBox11.Checked == true)
                eleven();
            if (checkBox12.Checked == true)
                twelve();
            if (checkBox13.Checked == true)
                threeteen();
            if (checkBox14.Checked == true)
                fourteen();
            if (checkBox15.Checked == true)
                fifteen();
            if (checkBox16.Checked == true)
                sixteen();

        }

        void one()
        {
            string one = @"Люди використовували для рахунку від пальців власних рук, камінчиків, примітивного рахункового приладу – абака, рахунків, механічного арифмометра, логарифмічної лінійки до електронного калькулятора і сучасних персональних комп'ютерів – настільних, портативних і кишенькових, здатних вирішувати найрізноманітніші завдання не тільки швидкого рахунку, а набагато складніші.  

У всі часи, починаючи із старовини, людям необхідно було вважати. Спочатку для рахунку використовували пальці власних рук або камінчики. Проте навіть прості арифметичні операції з великими числами важкі для мозку людини. Тому вже в давнину був придуманий простий інструмент для рахунку - абак, винайдений більше 15 століть назад в країнах Середземномор'я. Цим прообразом сучасних рахунків був набір кісточок, нанизаних на стрижні, і використовувався купцями.
Стрижні абака в арифметичному сенсі є десятковими розрядами. Кожна кісточка на першому стрижні має гідність 1, на другому стрижні - 10, на третьому стрижні - 100 і так далі До XVII століття рахівниці залишалися практично єдиним рахунковим інструментом.
У Росії так звані російські рахівниці з'явилися в XVI столітті. Вони засновані на десятковій системі числення і дозволяють швидко виконувати арифметичні дії.
У 1614 році математик Джон Непер винайшов логарифми.

Логарифм - це показник ступеня, в який потрібно звести число (підстава логарифма), щоб отримати інше задане число. Відкриття Непера полягало в тому, що у такий спосіб можна виразити будь-яке число і що сума логарифмів два будь-яких чисел дорівнює логарифму твору цих чисел. Це дало можливість звести дію множення до простішої дії складання. Непер створив таблиці логарифмів. Для того, щоб перемножити два числа, потрібно подивитися в цій таблиці їх логарифми, скласти їх і відшукати число, відповідне цій сумі, в зворотній таблиці - антилогарифмів. На основі цих таблиць в 1654 році Р. Біссакар і в 1657 році незалежно від нього С. Партрідж розробили прямокутну логарифмічну лінійку: основний рахунковий прилад інженера до середини XX століття.
У 1642 році Блез Паськаль винайшов механічну машину, що підсумовує, використовує десяткову систему числення. Кожен десятковий розряд представляло коліщатко з десятьма цифри від 0 до 9. Всього коліщаток було 8, тобто машина Паськаля була 8-розрядною. зубцями, що позначали
Проте перемогла в цифровій обчислювальній техніці не десяткова, а двійкова система числення. Головна причина цього в тому, що в природі зустрічається безліч явищ з двома стійкими станами, наприклад, *включено / выключено*, *є напруга / немає напруги*, *помилковий вислів / дійсний вислів*, а явища з десятьма стійкими станами - відсутні. Чому ж десяткова система так широко поширена? Та просто тому, що у людини на двох руках - десять пальців, і їх зручно використовувати для простого усного рахунку. Але в електронній обчислювальній техніці набагато простіше застосовувати двійкову систему числення всього з двома стійкими станами елементів і простими таблицями складання і множення. У сучасних цифрових обчислювальних машинах - комп'ютерах - двійкова система використовується не тільки для запису чисел, над якими потрібно проводити обчислювальні операції, але і для запису самих команд цих обчислень і навіть цілих програм операцій. При цьому всі обчислення і операції зводяться в комп'ютері до простих арифметичних дій над двійковими числами.
Одним з перших виявив цікавість до двійкової системи великий німецький математик Готфрід Лейбніц.У 1666 році в двадцятирічному віці, в роботі *О мистецтві комбінаторики* він розробив загальний метод, що дозволяє звести будь - яку думку до точних формальних висловів.Це відкрило можливість перевести логіку(Лейбніц називав її законами мислення) з визначаються точно і ясно.Таким чином, Лейбніц з'явився засновником формальної логіки. Він займався дослідженням двійкової системи числення. При цьому Лейбніц наділяв її якимсь містичним сенсом: цифру 1 він асоціював з Богом, а 0 - з порожнечею. Від цих двох цифр, на його думку, відбулося все. І за допомогою цих двох цифр можна виразити будь-яке математичне поняття. Лейбніц першим висловив думку, що двійкова система може стати універсальною логічною мовою. царства слів в царство математики, де стосунки між об'єктами і висловами
Лейбніц мріяв про побудову *універсальної науки*.Він хотів виділити прості поняття, за допомогою яких по певних правилах можна сформулювати поняття будь - якої складності.Мріяв про створення універсальної мови, на якій можна було б записувати будь - які думки у вигляді математичних формул.Думав про машину, яка могла б виводити теореми з на арифметичних. У 1673 році створив новий тип арифмометра - механічний калькулятор, який не тільки складає і віднімає числа, але і умножає, ділить, підносить до ступеня, витягує квадратне і кубічне коріння.У нім використовувалася двійкова система числення. аксіом, про перетворення логічних тверджень
Універсальна логічна мова створила в 1847 році англійського математика Джордж Буль.Він розробив числення висловів, згодом назване в його честь булевою алгеброю. Вона є формальною логікою, перекладеною строгою мовою математики.Формули булевої алгебри зовні схожі на формули тієї алгебри, що знайома нам з шкільної лави. Проте це схожість не тільки зовнішня, але і внутрішня. Булева алгебра -це цілком рівноправна алгебра, що підкоряється зведенню ухвалених при її створенні законів і правил. Вона є системою позначень, застосовною до будь-яких об'єктів - чисел, букв і пропозицій. Користуючись цією системою, можна закодувати будь-які твердження, істинність або помилковість яких потрібно довести, а потім маніпулювати ними подібно до звичайних чисел в математиці.
Буль Джордж(1815 - 1864) -англійський математик і логік, один з основоположників математичної логіки.Розробив алгебру логіки(у працях *Математичний аналіз логіки*(1847) і *Дослідження законів мислення*(1854).


Величезну роль в розповсюдженні булевої алгебри і її розвитку зіграв американський математик Чарльз Пірс.
Пірс Чарльз(1839 - 1914) - американський філософ, логік, математик і природодослідник, відомий своїми роботами по математичній логіці.


Предмет розгляду в алгебрі логіки - так звані вислови, тобто будь - які твердження, про які можна сказати, що вони або істинні, або помилкові: *Омськ - місто в Росії*, *15 - парне число* .Перший вислів істинний, друге - помилково.
Складні вислови, що отримуються з простих за допомогою союзів І, АБО, ЯКЩО...ТО, заперечення НЕ, також можуть бути істинними або помилковими.Їх істинність залежить тільки, наприклад: *Якщо на вулиці немає дощу, то можна піти гуляти*.Основне завдання булевої алгебри полягає у вивченні цієї залежності.Розглядаються логічні операції, що дозволяють будувати складні вислови з простих: заперечення(НЕ), кон'юнкція (И), диз'юнкція(АБО) та інші.від істинності або помилковості створюючих їх простих висловів
У 1804 році Ж.Жаккар винайшов ткацьку машину для вироблення тканин з крупним узором.Цей узор програмувався за допомогою цілої колоди перфокарт - прямокутних карток з записувалася пробивкою отворів(перфорацій), розташованих в певному порядку.При роботі машини ці перфокарти обмацувалися за допомогою спеціальних штирів.Саме таким механічним способом з них прочитувалася інформація для плетіння запрограмованого узору тканини.Машина Жаккара з'явилася прообразом машин з програмним управлінням, створених в ХХ столітті. картону. На них інформація про узор
У 1820 році Тома де Кольмар розробив перший комерційний арифмометр, здатний умножати і ділити.Починаючи з XIX століття, арифмометри набули широкого поширення при виконанні складних розрахунків.
У 1830 році Чарльз Беббідж спробував створити універсальну аналітичну машину, яка повинна була виконувати обчислення без участі людини.Для цього в неї вводилися записані на перфокартах з щільного паперу за допомогою отворів, зроблених на них в певному порядку(слово *перфорація* означає *пробивка отворів в папері або картоні*).Принципи програмування для аналітичної машини Беббіджа розробила в 1843 році Пекла Лавлейс - дочка поета Байрона.програми, які були заздалегідь
Аналітична машина повинна уміти запам'ятовувати дані і проміжні результати обчислень, тобто мати пам'ять.Ця машина повинна була містити три основні частини: пристрій для зберігання чисел, що набиралися за допомогою зубчатих коліс(пам'ять), пристрій для операцій над числами (арифметичний пристрій) і пристрій для операцій над числами за допомогою перфокарт (пристрій програмного управління). Робота із створення аналітичної машини не була завершена, але закладені в ній ідеї допомогли побудувати в XX столітті з англійського це слово означає *обчислювач*). перші комп'ютери(у перекладі
У 1880 році В.Т.Однер в Росії створив механічний арифмометр із зубчатими колесами, і в 1890 році налагодив його масовий випуск.Надалі під назвою *Фелікс* він випускався до 50 - х років XX століття.
У 1888 році Герман Холлеріт створив першу електромеханічну рахункову машину - табулятор, в якому нанесена на перфокарти інформація розшифровувалася електричним струмом.Ця машина дозволила у декілька разів скоротити час підрахунків при переписі населення в США.У 1890 р.винахід Холлеріта був вперше використаний в 11 - му американському переписі населення.Робота, яку 500 співробітників раніше виконували цілих 7 років, Холлеріт з 43 помічниками на 43 табуляторах закінчили за один місяць.
У 1896 році Холлеріт заснував фірму під назвою Tabulating Machine Co.У 1911 році ця компанія була об'єднана з двома іншими фірмами, що спеціалізувалися на автоматизації обробки статистичних даних, а свою сучасну назву IBM (International Business Machines) отримала в 1924 р. Вона стала електронною корпорацією, одним з найбільших світових виробників всіх видів комп'ютерів і програмного забезпечення, провайдером глобальних інформаційних мереж.Засновником IBM став Томас Уотсон Старший, такий, що очолив компанію в 1914 році, фактично створив корпорацію IBM і що керував нею більше 40 років.З середини 1950 - х років Ай - Би - Эм зайняла провідне положення на світовому комп'ютерному ринку. У 1981 році компанія створила свій перший персональний комп'ютер, який став стандартом в своїй галузі.До середини 1980 - х років IBM контролювала близько 60 % світового виробництва електронно - обчислювальних машин.";
              textBox1.Text +=Environment.NewLine+ one+Environment.NewLine;
        }
        public void button1_Click(object sender, EventArgs e)
        {
            textBox1.Text = "";
            one();
        }

        private void button2_Click(object sender, EventArgs e)
        {
            textBox1.Text = "";
            two();
        }
        void two()
        {

            string two = @"Комп’ютер складається з багатьох частин і пристроїв.

Можна виділити основні пристрої, тобто такі, без яких комп’ютер працювати не може:

1) системний блок;

2) монітор;

3) миша;

4) клавіатура.

Системний блок

Системний блок можна назвати найголовнішим пристроєм комп’ютера. Від його характеристик залежить швидкодія комп’ютера,  його надійність та інші властивості. Зазвичай системний блок є найдорожчою частиною комп’ютера. Системний  блок  зовні  схожий  до  металевий  ящик. У ньому містяться процесор, пам’ять, вінчестер  (жорсткий  магнітний  диск),  DWD-привід (пристрій для роботи з лазерними дисками).
Отже, в корпусі системного блока розташовані:

■  блок електричного живлення;

■  материнська плата, на якій знаходяться процесор, оператив­на пам’ять, звукова, відео- та мережна карти;

■  допоміжні  відділення,  в  яких  знаходяться  вінчестер,  пристрій для читання та запису дисків;

■  передня панель,  на якій  знаходяться кнопки  ввімкнення та перезавантаження,  світлові  індикатори  (лампочки),  порти для USB підключень, навушників, мікрофона та ін. Слід зауважити, що порти (гнізда) для під’єднання кабелю живлення та більшості пристроїв знаходяться на задній стінці системного блоку.



Процесор —  це  «мозок»  комп’ютера.  Саме  процесор  керує роботою всіх пристроїв. У ньому відбуваються всі операції, які виконує комп’ютер.

Пам'ять комп'ютера, або, точніше, оперативна пам'ять — це місце для інформації, з якою працює комп’ютер. У пам’яті зберігаються програми,  вхідні дані,  результати роботи. Після вимкнення комп’ютера інформація з пам’яті зникає. Тому інформацію для зберігання записують на вінчестер, на компакт-диск (лазерний диск).
Монітор - На  екрані  монітора  з’являється  інформація про роботу,  яку виконує комп’ютер. Можна сказати, що монітор —  це пристрій для виведення інформації.

Існують монітори  різних  типів:  на  основі  електропроменевої трубки (схожі за формою на телевізор), LCD, плазмові. Головною характеристикою для більшості користувачів є розмір  екрана по діагоналі. Проте не слід забувати, що кольоропередача, яскравість, частота і навіть зовнішній вигляд є досить важливими факторами.

Клавіатура

Це клавіатура.  На ній  є клавіші  із  зображеннями цифр,  букв та інших символів.  За допомогою клавіатури в комп’ютер вводять інформацію. Клавіатури розрізняють за різноманітними характеристиками: зручність, кольорове оформлення, наявність додаткових мультиме­дійних можливостей тощо.
Миша

Миша (точніше маніпулятор типу  «миша») слугує для керування комп’ютером. Миші бувають з різною роздільною здатністю,  різних типів та форм. Багато сучасних мишей, особливо ігрових, обладнані додатковими кнопками.

Пристрої, що розташовані поза  системним  блоком, ще називають периферійними.  Окрім  вже  описаних,  є  багато  пристроїв  та приладів. Часто  їх  об’єднують у групи для  зручності  вивчення  та класифікації. Звичайно, описати навіть частину пристроїв за урок неможливо.  Тому розглянемо найголовніші.
Пристрої введення інформації

Пристрій введення — пристрій для внесення даних до комп’ютера під час його роботи. До пристроїв введення належать миша та клавіатура. Саме  клавіатура  є  основним  пристроєм  введення  символів  та команд у комп’ютер.

Мишу здебільшого використовують для введення команд.

Пристрої виведення інформації

Щоб  користувач  міг  побачити  результати  роботи  комп’ютера,  їх потрібно подати у вигляді візуальної та звукової інформації. Для цього призначені пристрої виведення, серед яких найпоширеніші — монітор, звукові колонки та принтер.

Пристрої зберігання інформації

Усі комп’ютери потребують певного місця для запуску програм і збереження файлів.  Існують різні типи пам’яті та пристроїв для зберігання даних, кожен з яких використовують з певною метою.
Жорсткі диски

У кожному комп’ютері є один або кілька дисків  (їх називають вінчестерами). На жорстких дисках може зберігатися велика кількість  інформації,  зокрема фотографії,  відео,  музика,  документи, програми тощо. На жорсткому диску комп’ютера інформація зберігається навіть тоді, коли комп’ютер вимкнено. Існують  також  зовнішні жорсткі  диски.  Найпростіший  спосіб збільшення обсягу вільного місця на ПК — під’єднання зовнішнього жорсткого диска. Він може доповнювати обсяг внутрішнього жорсткого диска комп’ютера, особливо якщо внутрішній диск функціонує повільніше через брак місця. На зовнішньому жорсткому диску можна зберігати резервну копію важливих файлів.

Існують  також  зовнішні жорсткі  диски.  Найпростіший  спосіб збільшення обсягу вільного місця на ПК — під’єднання зовнішнього жорсткого диска. Він може доповнювати обсяг внутрішнього жорсткого диска комп’ютера, особливо якщо внутрішній диск функціонує повільніше через брак місця. На зовнішньому жорсткому диску можна зберігати резервну копію важливих файлів. Більшість таких жорстких дисків під’єднується до USB-порту. Пристрої читання СD і  DWD-дисків.

Майже всі комп’ютери сьогодні обладнано пристроями читання СD і DWD-дисків (приводами), які зазвичай розташовано на передній панелі системного блоку. За допомогою лазерів пристрої зчитують (отримують)  дані  з  диска.  Ці  пристрої можуть  також  записувати інформацію на диски.

Завдяки  наявності  в  комп’ютері  пристрою  читання  оптичних дисків,  можна переглядати  фільми  або  прослуховувати  музичні  DWD-диски.
Флеш-пам'ять  або  просто флешка —  це маленький  портативний  пристрій  у  вигляді  брелока,  який  підключається  до USВ-порту  комп’ютера.  Подібно  до  жорсткого  диска,    флеш-пам’ять використовується для зберігання  інформації, проте зазвичай її обсяг значно менший порівняно з більшістю жорстких дисків.   Флеш-пам’ять може  мати  різний  розмір,  форму  та  зберігати гігабайти даних. Такі пристрої зручно носити із собою, що дає змогу використовувати їх для перенесення інформації з одного комп’ютера на  інший.  Флеш-пам’ять  також  називають флешкою,  флеш-брелоком, флеш-накопичувачем.

У цифрових фотокамерах, телефонах інформація зберігається на картах пам’яті (флеш-пам’яті). Інформацію на картах пам’яті можна стирати та використовувати їх знову. Ноутбуки та деякі комп’ютери обладнано вбудованими пристроями читання карт пам’яті.
";
            textBox1.Text += Environment.NewLine + two + Environment.NewLine;
        }
        private void button3_Click(object sender, EventArgs e)
        {
            textBox1.Text = "";
            three();
        }
        void three ()
        {
            string three = @"Найважливішою частиною і основою комп’ютера є материнська плата.

Материнська плата (англ. Motherboard, також використовується назва англ. Mainboard – головна плата; сленг – мати, материнка) – це складна багатошарова плата, на якій встановлюються основні компоненти персонального комп’ютера: центральний процесор; контролер ОЗП; ОЗП; завантажувальний ПЗП; контролери базових інтерфейсів введення-виведення.

Як правило, материнська плата містить роз’єми (слоти) для підключення додаткових контролерів, для підключення яких зазвичай використовуються шини USB, PCI і PCI-Express.

Системна плата є найважливішим вузлом персонального комп’ютера. Але вона є не у всіх комп’ютерах. У деяких ПК елементи, що зазвичай встановлюються на системній платі, розташовані на окремих платах розширення, вставлених в роз’єми системної плати – слоти розширення. У комп’ютерах такого типа плата з роз’ємами називається об'єднувальною платою (backplane), а системні блоки подібної конструкції називаються об'єднувальними системними блоками.
Будова

Від материнської плати залежить функціональність комп'ютера, що визначається елементами самої плати і підключеними до неї пристроями. Основу материнської плати складає багатошарова пластина з провідними доріжками, якими електричний струм передається між складовими плати. Взаємодія деталей забезпечується чипсетом, який складається, як правило, з двох частин — північного моста (Northbridge) і південного моста (Southbridge). Зазвичай північний і південний міст розташовані на окремих мікросхемах. Передусім саме північний і південний мости визначають особливості системної плати і те, які пристрої можуть підключатися до неї. Іншими ключовими елементами є роз'єми для підключення центрального процесора, графічного адаптера, звукової плати, жорстких дисків, оперативної пам'яті. Крім них на платі містяться резистори, конденсатори, що підтримують роботу кожної деталі. Живлення материнської плати і відповідно всіх підключених до неї пристроїв забезпечується блоком живлення, поєднаним з платою кабелями.

Всі основні електронні схеми плати і необхідні додаткові пристрої інтегровано в системну плату, або вони підключаються до неї за допомогою слотів розширення. Слоти дозволяють підключати модулі оперативної пам'яті, відеокарти, додаткові пристрої, як панелі з USB-портами. Також материнська плата містить порти для підключення дискових і твердотільних накопичувачів, колодки підключення портів USB і кнопок, вмонтованих у корпус, живлення кулерів. Деякі сучасні системні плати підтримують бездротові пристрої, що використовують протоколи IrDA, Bluetooth, або 802.11 (Wi-Fi).

Системна плата без сумніву являє собою один з важливих компонентів ПК, оскільки 

поєднує всі інші частини комп'ютера в єдину систему. На материнську плату 

встановлюються головні компоненти обчислювальної системи:  

• Центральний процесор і його система охолодження; 

• Оперативна пам'ять; 

• Різні адаптери; 

• Підключаються накопичувачі даних. 

Будова материнської плати 

Материнська плата.



1. Процесорне гніздо; 

2. Мікросхеми системної логіки (чіпсет); 

3. Роз’єми для оперативної пам'яті; 

4. Інтерфейс шини AGP; 

5. Інтерфейси шини PCI; 

6. Інтерфейси підключення жорстких дисків і накопичувачів CD і DVD дисків; 

7. Блок портів введення/виведення; 

8. Роз’єми  для підключення живлення; 

9. Інтерфейс підключення дисководу. 

Всяка сучасна системна плата є багатошаровою. Звичайно, для виготовлення плати 

використовуються з'єднані один з одним два або чотири шари підкладок (кількість шарів 

досягає 8...10) - пластин з ізоляційного матеріалу, наприклад, скловолокна, між якими 

прокладені провідники, які поєднують електронну схему, змонтовану на одній зі сторін 

такої плати. У внутрішніх шарах розташовуються лінії електроживлення й екрана від 

наведень і перешкод. 

Зі споживчої ж точки зору, мабуть, вона грає найбільш істотну роль  - адже саме 

системна плата визначає основні характеристики ПК і задає межі можливого поліпшення 

його конфігурації. Характеристики системної плати, у свою чергу, по більшій частині 

визначаються набором мікросхем системної логіки (чипсетом). 

Спочатку завдання набору мікросхем полягало  в організації інформаційних потоків 

між ЦП, пам'яттю й шинами для підключення плат розширення. Однак, внаслідок високої 

комплексності сучасних чипсетів, актуальні моделі містять контролери практично всіх 

розповсюджених типів - дискові, мережні й інтерфейсні. Нерідко в  набір мікросхем 

вбудовується й графічний адаптер.   ";
            textBox1.Text += Environment.NewLine + three + Environment.NewLine;
        }
       
        private void button4_Click(object sender, EventArgs e)
        {
            textBox1.Text = "";
            four();

        }
        void four()
        {
            string four = @"Відеока́рта (англ. video card, також графічна карта, графічний адаптер, графічний прискорювач) — електронний пристрій, частина комп'ютера, призначена для генерації та обробки зображень з подальшим їхнім виведенням на екран периферійного пристрою.

Відеокарта зазвичай є платою розширення і вставляється у слот розширення, універсальний (PCI-Express, PCI, ISA, VLB, EISA, MCA) або спеціалізований (AGP), проте відеокарта може бути вбудованою у материнську плату як у вигляді окремого елементу, так і як складову частину північного мосту чипсету або центрального процесора. Відповідно вставлювана називається дискретною, а вбудована — інтегрованою.

Сучасні відеокарти не обмежуються лише звичайним виведенням зображень, вони мають вбудований графічний мікропроцесор, котрий може здійснювати додаткову їх обробку, звільняючи від цих задач центральний процесор. Також процесор і відокарта працюють разом і є залежними один від одного. Наприклад, усі сучасні відеокарти, що застосовують відеопроцесори AMD/ATi і NVIDIA підтримують OpenGL на апаратному рівні. Останнім часом, разом зі зростанням обчислювальних потужностей графічних процесорів має місце тенденція використовувати обчислювальні можливості графічного процесора для вирішення неграфічних задач (див. OpenCL).
Структура

Відеокарта S3 Graphics chrome 530 GT: під синім радіатором з кулером міститься відеопроцесор, дві чорні мікросхеми праворуч - відеопам'ять GDDR2, ліворуч - інтерфейси виведення HDMI і DVI, золотиста смужка внизу - шина PCI Express.
Друкована плата — пластина з діелектрика, на якій прокладено провідні доріжки, що пов'язують різні складові відеокарти.

Друкована плата — пластина з діелектрика, на якій прокладено провідні доріжки, що пов'язують різні складові відеокарти.
Шина підключення — комп'ютерна шина, через яку відеокарта обмінюється інформацією з материнською платою. Стандартними є AGP і PCI-E. Іноді PCI або ISA.
Графічний процесор (відеопроцесор, GPU (Graphics processing unit) — процесор, який обчислює інформацію, що виводиться на монітор. Може брати на себе частину обчислень з центрального процесора.
Відеопам'ять — мікросхеми, в які тимчасово поміщається інформація, обчислена графічним процесором. Відеопам'ять може бути виділена з основної оперативної пам'яті системи, в цьому випадку говорять про розподілену (shared) пам'ять. Як правило, чипи оперативної пам'яті припаяні прямо до друкованої плати, на відміну від знімних модулів системної пам'яті, які вставляються в стандартизовані розніми материнських плат.
Відеоконтролер (Video Display Controller, VDC) — мікросхема, що формує вихідний сигнал, який передається на монітор.
RAMDAC (Random Access Memory Digital-to-Analog Converter) або цифро-аналоговий перетворювач (ЦАП) — пристрій, що здійснює перетворення цифрових результатів роботи відеокарти в аналоговий сигнал, який відображається на моніторі. Можливостями цього пристрою визначається максимальна роздільність, кількість кольорів, насиченість картинки, частота кадрів.
Відео-ROM (Video ROM, Video BIOS) — мікросхема, що зберігає в собі правила і алгоритми взаємодій частин відеокарти.
Інтерфейси виведення (Output interfaces) — аналогові чи цифрові інтерфейси, які забезпечують передачу даних від відеокарти до дисплея. Зазвичай використовуються HDMI (цифровий), DVI (цифровий) та VGA (аналоговий).
Система охолодження — пристрій, що здійснює відведення і розсіювання тепла від відеопроцесора та інших складових відеокарти. Зазвичай це кулер (радіатор разом із вентилятором). Забезпечує стабільну роботу і не допускає ушкодження деталей від їх надмірного нагріву. Системи охолодження бувають активні (вентилятор з радіатором) чи пасивні (тільки радіатор). Раніше відеокарти випускались взагалі без охолодження, зараз трапляються відеоприскорювачі, вбудовані в материнську плату або процесор. Такі можуть мати активне, пасивне, взагалі не мати охолоджувального пристрою чи мати спільне охолодження (відеоприскорювач інтегрований в процесор). У разі відсутності активного охолодження, цей процес відбувається завдяки повітряним потокам, що циркулюють в системному блоці за рахунок вентиляторів в блоці живлення разом з вентилятором на процесорі.
Характеристики

Відеопроцесор
Робоча частота відеопроцесора — вимірюється в мегагерцах, тобто мільйонах тактів на секунду. Чим вища частота, тим більше відеопроцесор може обробити даних за одиницю часу.
Блоки — частини відеопроцесора, які обчислюють окремі елементи зображення: текстури, вершини, геометрію. Чим більше відповідних блоків, тим швидше процесор виконує операції з елементами зображення. Блоки можуть мати різну частоту, відповідно менша їх кількість компенсується вищою частотою.
Відеопам'ять
Обсяг відеопам'яті — пам'ять використовується для зберігання елементів зображення (текстур, вершин, даних буферів і т. д.) які будуть виведені на монітор. Вимірюється в мегабайтах і гігабайтах. Обсяг не визначає напряму продуктивність відеокарти, а лише в поєднанні з іншими характеристиками. Проте багато комп'ютерних програм вимагають певного мінімуму відеопам'яті, особливо програми для роботи з графікою і відеоігри.
Частота відеопам'яті — визначає скільки операцій записування/читання може виконатися за такт. Ця характеристика тісно пов'язана з типом пам'яті, зазвичай використовується спеціальна GDDR. Пізніші типи мають швидшу передачу даних, так GDDR3 повільніша за GDDR5.
Розрядність шини — визначає як швидко пам'ять обмінюється даними з відеопроцесором. Вимірюється в бітах: 64, 128, 256, 512 і т. д. Часто виробники компенсують повільність відеопам'яті більшою розрядністю шини, або навпаки — зменшують розрядність, натомість використовують пам'ять з вищою частотою.

Охолодження
Зі зростанням навантаження на відеопроцесор його температура зростає, що призводить до пропуску тактів чи навіть може спричинити деформацію та розплавлення деталей відеокарти. Для уникнення цього використовуються системи охолодження. Їхній дизайн визначається виробником графічного процесора (тоді зветься референсним) або користувача (кастомний).

Пасивне — складається з радіатора, який відводить зайве тепло. Чим складніша форма радіатора, тим більшою є його площа і можливості до відведення тепла.
Активне — складається з радіатора і вентилятора, іноді має систему охолодження рідиною: водою чи рідким азотом. Кулер створює потік повітря, який охолоджує радіатор. Потужніші кулери створюють більше шуму, але часто ними можна керувати через спеціальні програми.
Форм-фактор
Низькопрофільні — мають невеликі розміри, займають один слот розширення в ПК (50-60 мм у висоту). Як правило мають порівняно невисоку продуктивність, але можуть встановлюватися в невеликі корпуси, ноутбуки, нетбуки.
Повнопрофільні — мають великі розміри, декоративні й охолоджувальні кожухи, великі радіатори і кулери, зазвичай займають два слоти розширення.
Вирішення неграфічних задач
Паралельні обчислення
Технологія обчислень загального призначення на графічних процесорних одиницях GPGPU (General-purpose computing on graphics processing units) дозволяє задіювати обчислювальні потужності графічних процесорів для таких задач, як обчислення фізики тривимірних об'єктів у відеоіграх, частково звільняючи від них центральний процесор. Останній таким чином отримує змогу паралельно виконувати інші обчислення. Так, у nVidia технологією GPGPU є CUDA, а у ATI — Stream[6][7].

Майнінг криптовалют
Завдяки високій обчислювальній потужності у 2010 році і до сьогодні набув поширення майнінг (англ. mining, дослівно «видобуток») криптовалют за допомогою графічних процесорів. Він здійснюється шляхом підбору геш-коду з-поміж численних комбінацій за допомогою спеціальних програм - манерів. Графічні процесори в цьому випадку більш ефективні за центральні, позаяк передусім розраховані на однотипні часто повторювані задачі. Валюта зараховується на попередньо створений електронний гаманець або майнінг-пул, де розділяється серед учасників процесу в залежності від внеску у видобуток.

Для збільшення виходу криптовалюти відеокарти об'єднуються на так званих фермах: комп'ютерах, материнська плата яких має кілька слотів підключення графічних адаптерів, наділених потужним блоком живлення і ефективною системою охолодження. Обмеження драйверів відеокарт зазвичай не дозволяють використовувати на одній платі понад 4-8 відеоадаптерів[8][9].

Пік популярності майнінгу відбувся в травні-липні 2017 року через різке зростання курсу криптовалют. Типова ферма за курсу біткоїна до $3000 могла окупитися вже за 3-4 місяці. Це швидко спричинило стрибок цін на відеокарти, дефіцит потужних геймерських карт і випуск спеціалізованих саме для майнінгу карт і материнських плат[10][11][12]. На кінець 2018 року ціни помітно стабілізувалися, проте видобуток криптовалют ще довгий час буде однією з неграфічних задач відеоадаптерів.
";
            textBox1.Text += Environment.NewLine + four + Environment.NewLine;
        }

        private void button5_Click(object sender, EventArgs e)
        {
            textBox1.Text = "";
            five();
        }
        void five()
        {                       
            string five = @"Оперативна пам'ять — швидкодійна пам'ять, призначена для запису, зберігання та читання інформації у процесі її обробки.

В обчисленні, пам'ять належить до комп'ютерних пристроїв, що використовуються для зберігання інформації для негайного використання в комп'ютері; вона є синонімом терміна «первинне зберігання». Комп'ютерна пам'ять працює на високій швидкості, наприклад, оперативна пам'ять (RAM), на відміну від зберігання, що забезпечує зберігання даних та повільно-доступних програм, пропонує більш високі можливості. При необхідності, вміст пам'яті комп'ютера може бути переданий у вторинне сховище, за допомогою технології управління пам'яттю під назвою «віртуальна пам'ять». Архаїчний синонім пам'яті — сховище.[1]

Термін «пам'ять», що означає «первинне сховище» або «основну пам'ять», часто асоціюється з адресацією напівпровідникової пам'яті, тобто інтегральних схем, що складаються з транзисторів на основі кремнію, що використовуються, наприклад, як первинне зберігання, але також і в інших цілях в комп'ютерах та інших цифрових електронних пристроях. Є два основні типи напівпровідників пам'яті, летючі і нелетючі. Приклади незалежної пам'яті — це флеш-пам'ять (використовується як вторинна пам'ять) і ROM, PROM, EPROM і EEPROM (використовуються для зберігання прошивки, такі як BIOS). Прикладом незалежної пам'яті є первинне зберігання (як правило, динамічне RAM, DRAM) і швидкий процесор кеш-пам'яті (зазвичай статична оперативна пам'ять RAM, SRAM, яка є швидкою, але енергоємною, і пропонує меншу ємність пам'яті на одиницю площі, ніж DRAM).

Найбільший напівпровідниковий запам'ятовуючий пристрій складається з комірок пам'яті або бістабільних тригерів, кожен з яких зберігає один біт (0 або 1). Організація флеш-пам'яті включає в себе як один біт на комірку пам'яті, так і кілька бітів на клітинку (так звані ДОК, кілька осередків). Осередки пам'яті згруповані в слова фіксованої довжини, наприклад, 1, 2, 4, 8, 16, 32, 64 або 128 біт. Кожне слово можна отримати за допомогою довічної адреси N біт. Це означає, що регістри процесора зазвичай не розглядаються як пам'ять, так як вони тільки зберігають одне слово і не включають в себе механізм адресації.

Типові вторинні пристрої зберігання жорстких дисків і твердотільних накопичувачів.Енергонезалежна комп'ютерна пам'ять, яка вимагає потужності для підтримки збереженої інформації. Більшість сучасної напівпровідникової незалежної пам'яті або статичні RAM (SRAM) або динамічні RAM (DRAM). SRAM зберігає свій вміст, поки живлення підключене і легке для взаємодії, але використовує шість транзисторів на біт. Динамічна оперативна пам'ять складніша для взаємодії і управління, і потребує регулярних циклів оновлення для запобігання втрати його вмісту, але використовує тільки один транзистор і один конденсатор на біт, що дозволяє досягти значно вищої щільності і дешевшої витрати на біт.

SRAM не підходить для робочого столу системної пам'яті, де домінує DRAM, але використовується для кеша. SRAM є звичайною справою в невеликих вбудованих системах, які, можливо, потребують тільки десятки кілобайт або менше. Майбутні летючі технології пам'яті, які сподіваються замінити або конкурувати з SRAM і DRAM і включають Z-RAM[en] та A-RAM[en].
Правильне управління пам'яттю є життєво важливим для комп'ютерної системи, щоб працювати правильно. Сучасні операційні системи мають складні системи, щоб належним чином управляти пам'яттю. Невиконання цієї вимоги може призвести до помилок, низької продуктивності, а в гіршому випадку, приєднання до вірусів і шкідливого програмного забезпечення.

Майже всі програмісти повинні розглянути, як управляти пам'яттю. Навіть збереження номера в пам'яті вимагає від програміста вказати, як пам'ять повинна зберігати його.
Оперативна пам'ять (ОЗП – оперативний запам'ятовуючий пристрій, або RAM – Random Access Memory — пам'ять із довільним доступом) – швидкодіюча пам'ять, призначена для запису, зберігання та читання інформації у процесі її обробки. Вона розміщена на системній платі і розділена на окремі комірки, кожна з яких має унікальне ім’я (адресу). Процесор у будь-який момент часу може звернутися до будь-якої комірки оперативної пам’яті для зчитування або запису даних.

Ємність оперативної пам’яті становить від кількох сотень мегабайтів до кількох гігабайтів. Для сучасної оперативної пам’яті швидкість обміну даними між нею і процесором – понад 10 гігабітів за секунду.

Для підвищення швидкості обміну даними між процесором і оперативною пам’яттю використовують кеш-пам’ять (англ. cache memory – пам’ять про запас). У ній робиться своєрідний запас даних, до яких може звернутися процесор під час подальшої роботи.

Вона має значно більшу швидкість обміну даними з процесором порівняно з оперативною пам’яттю.

Розрізняють кеш-пам’ять першого рівня (ємність 32 кілобайти), другого рівня (ємність 6 мегабайтів і більше) і третього рівня (ємність більше 8 мегабайтів). Кеш-пам’ять першого і другого рівня розміщують у складі мікросхеми процесора, третього рівня, як правило, – на системній платі.

Оперативна память(рекомендації)
як вибрати оперативну память, загальні рекомендації, ціни



При виборі оперативної пам'яті в першу чергу слід звернути увагу на фірму-виготівника. Брати варто RAM відомих виробників - Samsung (SEC), Micron, Hynix (Hyundai), Kingston, Corsair, OCZ, Transcend, TwinMos. 

Далі звертаємо увагу на числа, що вказуються після типу пам'яті (наприклад, РС400 3200). В даному випадку число 400 означає подвоєну тактову частоту пам'яті в мегагерцах (MHz), a 3200 - швидкість роботи в мегабайтах в секунду (Mb/s). Тримати в пам'яті усе це, загалом, не треба - досить пам'ятати, що чим більше циферки після назви пам'яті, тим краще. 

Наступний важливий параметр при виборі RAM - це CAS Latency, або CL. Цей параметр означає час затримки при зверненні до пам'яті. Простіше кажучи - скільки часу комп'ютеру треба для здійснення циклу читання/запису в пам'ять/з пам'яті. Але це теж запам'ятовувати абсолютно необов'язково - досить запам'ятати, що чим менше цей параметр, тим краще. 

Зовсім незайвим при купівлі оперативної пам'яті буде поцікавитися про її сумісність з материнською платою. Щоб не потрапити в халепу, слід брати пам'ять DDR-типу і побоюватися пам'яті RIMM : вона була призначена для перших Pentium IV, визнана неперспективною і вже давно не робиться. 

Скільки пам'яті потрібно вашій машині? Для офісного або простого домашнього комп'ютера (поспілкуватися з друзями в Інтернеті, обробити фото з цифрового фотоапарата, подивитися фільм) досить буде 1024 мегабайт (Mb). Якщо ж ваша робота пов'язана з графікою, відео, аудіо або ви хочете грати в сучасні ігри, то об'єм пам'яті треба як мінімум подвоїти чи потроїти- до 1-3 гігабайта (Gb). Втім, якщо вас дратують *гальма* під час роботи або гри або ви хочете узяти пам'ять з далеким прицілом на застарівання комп'ютера, то RAM можна збільшити до 4-гігабайт і більше. 

Слід зауважити, що оперативна пам'ять робиться із вже передвстановленим фіксованим об'ємом - як правило, крок в сучасних планках складає 2 Гігабайт.В материнську плату, як правило, можна вставити до 4 планок.Якого об'єму і скільки їх буде - вирішувати тільки вам. Майте лише на увазі, що чим більше об'єм однієї планки, тим вища ціна, тобто одна планка на 2 Гігабайт коштуватиме трохи дорожче, ніж дві по 1 Гб, але при цьому економиться місце на материнській платі.

 Ціни станом на березень 2012(приблизно)  для ПК: ДДР3 1024мгб  100 - 120грв, 2048мгб 120 - 170грв, 4 гб 200 - 250грв(залежно від бренду), а для ноутів дорожче. Успіхів у виборі)) 

";


            textBox1.Text += Environment.NewLine + five + Environment.NewLine;
           
        }
        private void button6_Click(object sender, EventArgs e)
        {
            textBox1.Text = "";
            sixth();
        }
        void sixth()
        {
            string sixth = @"Центральний процесор, ЦП (англ. Central processing unit, CPU) — функціональна частина комп'ютера, що призначена для інтерпретації команд.
Функції
обробка даних по заданій програмі шляхом виконання арифметичних і логічних операцій;
програмне керування роботою пристроїв комп'ютера.
 Архітектура системи команд
З погляду програмістів, під архітектурою процесора мається на увазі його здатність виконувати певний набір машинних кодів. Більшість сучасних десктопних процесорів відносяться до сімейства x86, або Intel-сумісних процесорів архітектури IA32 (архітектура 32-бітових процесорів Intel). Її основа була закладена компанією Intel в процесорі i80386, проте в подальших поколіннях процесорів вона була доповнена і розширена як самою Intel (введені нові набори команд MMX, SSE, SSE2 і SSE3), так і сторонніми виробниками (набори команд EMMX, 3DNow! і Extended 3DNow!, розроблені компанією AMD).
Мікроархітектура
Розробники комп'ютерного устаткування вкладають в поняття «Архітектура процесора» основні принципи внутрішньої організації конкретних сімейств процесорів. Наприклад, архітектура процесорів Intel Pentium позначалася як Р5, процесорів Pentium II і Pentium III — Р6, а Pentium 4 відносилися до архітектури NetBurst. Після того, як компанія Intel закрила архітектуру Р5 для сторонніх виробників, її основний конкурент — компанія AMD розробляла власні архітектури — K5, K6, К7 (для процесорів Athlon і Athlon XP), і К8 (для Athlon 64).
 Ядро мікропроцесора
В рамках однієї і тієї ж архітектури різні процесори можуть досить сильно відрізнятися один від одного. І відмінності ці утілюються в різноманітних процесорних ядрах, що володіють певним набором суворо обумовлених характеристик. Найчастіше ці відмінності втілюються в різних частотах системної шини (FSB), розмірах кеша другого рівня, підтримці тих або інших нових систем команд або технологічних процесах, за якими виготовляються процесори. Нерідко зміна ядра в одному і тому ж сімействі процесорів спричиняє за собою заміну процесорного роз'єму (сокет, англ. socket), з чого витікають питання подальшої сумісності материнських плат. Проте в процесі вдосконалення ядра виробникам доводиться вносити до нього незначні зміни, які не можуть претендувати на *власне ім'я*. Такі зміни називаються ревізіями (англ. stepping) ядра і, найчастіше, позначаються цифробуквенними комбінаціями. Проте в нових ревізіях одного і того ж ядра можуть зустрічатися досить помітні нововведення. Так, компанія Intel ввела підтримку 64-бітової архітектури EM64T в окремі процесори сімейства Pentium 4 саме в процесі зміни ревізії.
 Машинне слово, 32 біти та 64 біти
Найуспішнішими і найпоширенішими донедавна були процесори з архітектурою IA32, яка була введена з появою покоління процесорів i80386 на заміну 16-бітним 8086, 80186, 80286.

Досить вдале 64-бітове розширення класичної 32-бітової архітектури IA32 було запропоноване в 2002 році компанією AMD (спочатку називалося x86-64, зараз — AMD64) в процесорах сімейства К8. Через деякий час компанією Intel було запропоновано власне позначення — EM64T (англ. Extended Memory 64-bit Technology). Але, незалежно від назви, суть нової архітектури одна і та ж: розрядність основних внутрішніх регістрів 64-бітових процесорів подвоїлася (з 32 до 64 біт), а 32-бітові команди x86-кода отримали 64-бітові аналоги. Крім того, за рахунок розширення розрядності шини адрес обсяг пам'яті, що адресується процесором, істотно збільшився.

Продуктивність 64-бітових процесорів в переважній більшості сучасних застосунків (які в масі своїй підігнані під IA32) практично та ж, що і у 32-бітових. Для пересічного користувача потенціал 64-бітової архітектури може розкритися тоді, коли масово з'являться додатки, оптимізовані під нову архітектуру. Найефективнішим перехід на 64-бітові процесори стане для програм, що активно працюють з великими обсягами пам'яті, понад 4 ГБ: високопродуктивних серверів, баз даних, програм класу CAD/CAE, а також програм для роботи з цифровим контентом.
Багатоядерні процесори
Перший багатоядерний процесор створила Rockwell у 1984 році, об'єднавши два ядра R6502.[1] В 2005 році з'явились перші двоядерні мікропроцесори архітектури x86 — Intel Pentium D та AMD Athlon 64 X2. До того часу класичні одноядерні CPU певною мірою вичерпали резерви зростання продуктивності за рахунок підвищення робочої частоти. Каменем спотикання стало не тільки дуже високе тепловиділення процесорів, що працюють на високих частотах, але і проблеми з їхньою стабільністю. Отже, екстенсивний шлях розвитку процесорів вичерпався і виробникам довелося освоювати новий, інтенсивний шлях підвищення продуктивності продукції.

На сьогоднішній день для роботи з двоядерними процесорами більш-менш оптимізовано в основному професійне ПЗ (включаючи роботу з графікою, аудіо- і відеоданими), тоді як для офісного або домашнього користувача друге процесорне ядро іноді приносить користь, але частіше є мертвим вантажем. Але ринок неухильно рухається у бік мультиядерних систем і оптимізованих паралельних обчислень. Така тенденція буде пануючою найближчими роками, так що частка ПЗ, оптимізованого під декілька ядер, неухильно зростатиме, і дуже скоро може наступити момент, коли багатоядерність стане насущною необхідністю.
";
            textBox1.Text += Environment.NewLine + sixth + Environment.NewLine;
        }
        private void button7_Click(object sender, EventArgs e)
        {
            textBox1.Text = "";
            seven();
        }
        void seven()
        {
            string four = @"Комп'ю́терна ши́на (англ. computer bus, походить від латинського omnibus, що означає — «для всіх») служить для передачі даних між окремими функціональними блоками комп'ютера і є сукупністю сигнальних ліній, які мають певні електричні характеристики і протоколи передачі інформації. Шини можуть розрізнятися розрядністю, способом передачі сигналу (послідовні або паралельні, синхронні або асинхронні), пропускною здатністю, кількістю і типами підтримуваних пристроїв, протоколом роботи, призначенням (внутрішня або інтерфейсна).

Традиційно в електроніці шиною звався інформаційний канал, до якого приєднувалася низка пристроїв, які могли читати та передавати дані. Але з розвитком комп'ютерних технологій шинами за аналогією стали називати з'єднання типу точка-точка (наприклад AGP чи HyperTransport), а також канали зі складною диспетчеризацією доступу.

Існують і спеціалізовані шини, такі як внутрішні шини процесорів або шина для підключення відеоадаптерів — AGP.

Усі стандарти розрізняються як за кількістю й використанням сигналів, так і за протоколами їхнього обслуговування.

Шина входить до складу материнської плати, на якій розташовуються її провідники і роз'єми (слоти) для підключення плат адаптерів пристроїв (відеокарти, звукові карти, внутрішні модеми, накопичувачі інформації, пристрої введення/виведення і т. д.) і розширень базової конфігурації (додаткові пусті роз'єми).

Існують 16- і 32-розрядні, високопродуктивні (VESA, VLB, AGP і РСІ із тактовою частотою більше 16 МГц) і низькопродуктивні (ISA і EISA із тактовою частотою 8 і 16 МГц) системні шини. Також шини, розроблені за сучасними стандартами (VESA, VLB і РСІ), допускають підключення декількох однакових пристроїв, наприклад декілька жорстких дисків, а шина РСІ забезпечує самостійну конфігурацію периферійного (додаткового) устаткування — підтримку стандарту Plug and Play, що виключає ручну конфігурацію апаратних параметрів периферійного устаткування при його зміні або нарощуванні. Операційна система, яка підтримує цей стандарт, сама налаштовує устаткування, підключене через шину РСІ, без втручання користувача.

Існують як 64-розрядні розширення шини РСІ, так і 32-розрядні, що працюють на частоті 66 МГц.
Адресна шина — по адресній шині пересилаються адреси комірок оперативної пам'яті, з яких процесор вибирає команди та дані для цих команд. В сучасних комп'ютерах адресна шина є 32-розрядною, тобто складається з 32 провідників.

Основною характеристикою шини адреси є її ширина в бітах. Ширина шини адреси визначає обсяг пам'яті, що адресується. Наприклад, якщо ширина адресної шини становить 20 біт, і розмір слова пам'яті дорівнює одному байту, то обсяг пам'яті, який можна адресувати, становить 220 = 1 048 576 байт (1 МБайт) як в IBM PC/XT.

З точки зору архітектури мікропроцесорної системи, якщо не застосовувати мультиплексування, кожен біт в адресі визначається одним провідником (лінією) в магістралі, по якій передається адреса.

Якщо розглядати структурну схему мікро ЕОМ, то адресна шина активізує роботу всіх зовнішніх пристроїв по команді, що надходить з мікропроцесора.
Шина даних — шина, призначена для передачі інформації. У комп'ютерній техніці прийнято розрізняти виводи пристроїв за призначенням: одні слугують для передачі інформації (наприклад у вигляді сигналів низького або високого рівнів), інші для поєднання всіх пристроїв (шина адреси) — кому ці конкретні дані призначені.

Основною характеристикою шини даних є її ширина у бітах. Ширина шини даних визначає кількість інформації, яку можна передати за один такт через неї.
Командна шина. По командній шині до процесора надходять команди, від нього керуючі команди до оперативної пам'яті або до пристроїв вводу/виводу. Командна шина визначає розрядність процесора і для сучасних комп'ютерів є 64-розрядною.

Шини на материнській платі використовуються не лише для зв'язку внутрішніх пристроїв з процесором. Вони також взаємодіють з пристроями, що під'єднуються до материнської плати або через внутрішні роз'єми — слоти, або через зовнішні роз'єми.
";
            textBox1.Text += Environment.NewLine + four + Environment.NewLine;
        }
        private void button8_Click(object sender, EventArgs e)
        {
            textBox1.Text = "";
            eight();
           
        }
        void eight()
        {
            string four = @"Постійна пам'ять (ПЗП або ROM – англ. Read Only Memory — пам’ять тільки для читання) — швидкодіюча енергонезалежна пам'ять, призначена для зберігання інформації, що не змінюється під час виконання програм. Ця пам’ять невелика за ємністю (кілька сотень кілобайтів) і містить програму тестування пристроїв комп’ютера при ввімкненні – POST (англ. Power-On Self Test — самоперевірка при ввімкненні енергії) та базову систему введення-виведення – BIOS (англ. Basic Input/Output System).

Особливістю постійної пам’яті є те, що дані, які в ній містяться, не зникають при вимкненні живлення комп’ютера. Постійна пам’ять виготовляється у вигляді спеціальної мікросхеми, яку розміщують на системній платі.

Дані в постійну пам’ять заносяться у процесі її виготовлення. Розрізняють мікросхеми постійної пам’яті без можливості перепрограмування і з можливістю багаторазового перепрограмування. За потреби користувач може замінити мікросхему постійної пам’яті або виконати її перепрограмування.
Постійна пам'ять (ПЗП або ROM – англ. Read Only Memory — пам’ять тільки для читання) — швидкодіюча енергонезалежна пам'ять, призначена для зберігання інформації, що не змінюється під час виконання програм. Ця пам’ять невелика за ємністю (кілька сотень кілобайтів) і містить програму тестування пристроїв комп’ютера при ввімкненні – POST (англ. Power-On Self Test — самоперевірка при ввімкненні енергії) та базову систему введення-виведення – BIOS (англ. Basic Input/Output System).
                Особливістю постійної пам’яті є те, що дані, які в ній містяться, не зникають при вимкненні живлення комп’ютера. Постійна пам’ять виготовляється у вигляді спеціальної мікросхеми, яку розміщують на системній платі.

                Дані в постійну пам’ять заносяться у процесі її виготовлення. Розрізняють мікросхеми постійної пам’яті без можливості перепрограмування і з можливістю багаторазового перепрограмування. За потреби користувач може замінити мікросхему постійної пам’яті або виконати її перепрограмування.
";
            textBox1.Text += Environment.NewLine + four + Environment.NewLine;
        }
        private void button9_Click(object sender, EventArgs e)
        {
            textBox1.Text = "";
            nine();
           
        }
        void nine()
        {
            string four = @"На сьогодні в комп'ютерній техніці використовуються два основних типи запам'ятовуючих пристроїв - це жорсткі диски і SSD. 

Жорсткий диск (HDD)

Жорсткий диск (накопичувач на жорстких магнітних дисках (НЖМД), *вінчестер*, англ. - hard disk drive (HDD) - пристрій для зберігання інформації, в якому використовується принцип магнітного запису. Всередині жорсткого диску запис даних здійснюється на жорсткі пластини, виготовлені з легкометалевого сплаву або скла, вкриті шаром спеціального магнітного матеріалу (найчастіше - двоокисом хрому). Залежно від конструкції, в HDD можуть використовуватися одна або кілька таких пластин, що швидко обертаються на одній осі. За рахунок обертання створюється своєрідний підпір повітря, завдяки якому зчитувальні головки не торкаються поверхні пластин, хоч і знаходяться дуже близько від них (всього кілька нанометрів). Це гарантує надійність запису та зчитування даних. При зупинці пластин головки переміщуються за межі їх поверхні, тому механічний контакт між головками та пластинами практично виключений. Така конструкція забезпечує довговічність запам'ятовуючих пристроїв цього типу.

Крім пластин, до складу HDD входить накопичувач, привод і блок електроніки.

Завдяки високій надійності роботи і відносно невисокій вартості, жорсткі диски є найпоширенішим пристроєм зберігання інформації.

У розмовній мові HDD часто називають *вінчестером* або скорочено *вінтом*.Цей термін колись давно був запозичений у мисливського гвинтівкового патрона *30-30 Winchester*, популярного в США на момент створення першого жорсткого диска, який у той час носив співзвучну з ним назву *30-30*.
SSD

SSD (solid state-drive) або твердотільний накопичувач - запам'ятовуючий пристрій відносно нового типу, який працює на основі використання мікросхем пам'яті і на відміну від HDD не містить рухомих частин.

Цей тип пристроїв порівняно з HDD має ряд переваг: відсутність буль-якої вібрації і шуму, низьке енергоспоживання, більш висока швидкість роботи при невеликих розмірах, стійкість до температурних коливань і механічного впливу й ін.

Найбільшими недоліками SSD є їх висока вартість і швидкість зношування (зазвичай, близько 10 тис. циклів перезапису, у більш дорогих виробах - до 100 тис.). Останнє обов'язково повинне враховуватися при їх експлуатації. Не рекомендується проводити дефрагментацію таких носіїв (це ніяк не прискорить пошук інформації), розміщувати на них файл підкачки, а також здійснювати інші дії, пов'язані з їх *невиправданим* використанням. Серед операційних систем сімейства Windows тільки Windows 7 враховує ці особливості. При використанні більш ранніх версій ОС Windows термін служби SSD скорочується.

Ймовірно, пройшовши низку вдосконалень, носії SSD з часом витіснять класичні жорсткі диски. Але поки для рядового користувача останні залишаються кращим варіантом з точки зору як довговічності, так і вартості. 
Основні характеристики HDD та SSD:

• Ємкість - показник, що визначає кількість даних, які на ньому можна зберігати. Сьогодні існують жорсткі диски ємністю понад 4000 ГБ. Максимальні показники SSD більш низькі. Потрібно враховувати, що при маркуванні ємності запам'ятовуючих пристроїв, виробники використовують величини, кратні не 1024 (як зазвичай прийнято), а 1000. Тобто вінчестер, ємність якого згідно маркування дорівнює 500 ГБ, насправді зможе зберігати не більше 465 ГБ інформації.

• Інтерфейс - сукупність ліній зв'язку, якими запам'ятовуючий пристрій підключається до материнської плати комп'ютера. Кожен тип інтерфейсу має свої особливості і швидкість передачі даних. Найбільш поширеним на даний момент є інтерфейс SATA. Більш старий PATA поки також зустрічається часто.

• Форм-фактор, а інакше кажучи фізичний розмір пристрою, вимірюється в дюймах. Класичний жорсткий диск має форм-фактор 3,5 дюйма. В ноутбуках, нетбуках і інших портативних пристроях найчастіше використовуються пристрої 2,5 або 1,8 дюйма, хоча зустрічаються й інші варіанти.

• Час довільного доступу (RAT, random access time) - цей показник має значення тільки при виборі жорстких дисків (для SSD не актуально) і означає середній проміжок часу, за який пристрій здійснює позиціонування головки на потрібну ділянку магнітної пластини. Цей параметр у сучасних пристроїв варіює в межах 2,5 - 16 мс (чим менше, тим краще).

• Швидкість обертання шпинделя - кількість обертів магнітних пластин жорсткого диска за 1 хвилину (для SSD не актуально). Від цього показника безпосередньо залежить продуктивність пристрою (чим вище, тим краще), а також його енергоспоживання, ступінь вібрації і шуму (чим менше, тим краще). Тут важливий баланс: для стаціонарних комп'ютерів краще вибрати більш швидкий носій, для портативного - більш економічний і тихий. Швидкість обертання шпинделя сучасних жорстких дисків може варіювати від 4200 до 15000 оборотів в хвилину.

• Об'єм буфера - спеціальної внутрішньої швидкої пам'яті диска, що використовується для тимчасового зберігання даних з метою згладжування перебоїв при зчитуванні та записі інформації на носій і її передачі по інтерфейсу. У сучасних запам'ятовуючих пристроях буфер може досягати розмірів до 64 МБ. Чим цей показник більший, тим краще.

Це основні характеристики запам'ятовуючих пристроїв. Іноді говорять також про кількість операцій введення-виведення в секунду, рівень споживання електроенергії, ударостійкість, швидкість передачі інформації та ін. 


За всю історію свого існування жорсткі диски виготовлялися багатьма фірмами. У зв'язку з поглинанням одних фірм іншими, станом на момент підготовки цього матеріалу на ринку залишалося тільки три виробника цього типу пристроїв: Toshiba, WD (Western Digital) і Seagate. Їх продукція втілює багаторічний досвід роботи і є досить якісною.

Із запам‘ятовуючими пристроями типу SSD ситуація дещо інша. Це абсолютно нова галузь, в якій свої сили випробовує багато виробників. Говорити про більш високу якість продукції окремих з них поки немає підстав.
Твердий диск (Hard Disk Drive, HDD), також вінчестер, жорсткий диск — постійний запам'ятовуючий пристрій ЕОМ. Постійний, означає, що на відміну від оперативної пам'яті, продовжує зберігати дані після вимикання струму.
Перші тверді диски з`явилися на початку 70-х років. Вони мали ємкість не більше десятка кілобайтів. У 1973 році фірма IBM випустила жорсткий диск моделі 3340, що вперше об'єднав в одному нероз'ємному корпусі пластини диска й голівки, що зчитують. При його розробці інженери використали коротку внутрішню назву *30 - 30*, що означало два модулі (у максимальному компонуванні) по 30 Мб кожний. Кеннет Хотон, керівник проекту, через співзвучність назви з позначенням популярної мисливської рушниці *Winchester 30 - 30* запропонував назвати цей диск *вінчестером*
З часом ємкість твердого диску виросла в тисячі разів хоча його будова не дуже змінилась.

Конструкція жорсткого диска
Кожен твердий диск складається з трьох блоків.
•	Перший блок. На першому блоці зберігається вся інформація. 1 - й блок представляє з себе один або декілька скляних або алюмінієвих дисків, вкритих з двох сторін магнітним шаром, на який записується інформація.
•	Другий блок — механіка твердого диску.Другий блок забезпечує обертання першого блоку(тобто самих дисків) і точне позиціонування головок зчитування.
•	Третій блок— електронна логіка твердого диску.
Характеристики
Інтерфейс — набір, що складається з ліній зв'язку, сигналів, що посилають по цих лініях, технічних засобів, що підтримують ці лінії, і правил обміну. Сучасні накопичувачі можуть використати інтерфейси ATA (AT Attachment, він же IDE — Integrated Drive Electronic, він же Parallel ATA), (EIDE), Serial ATA, SCSI (Small Computer System Interface), SAS, FireWire, USB, SDIO і Fibre Channel.
Ємність(англ.capacity) — кількість даних, які можуть зберігатися накопичувачем.Ємність сучасних пристроїв досягає 1000 Гб.На відміну від прийнятої в інформатиці(випадково) системі приставок, що позначають кратну 1024 величину, виробниками при позначенні ємності жорстких дисків використаються кратні 1000 величини.Так, напр., ємність жорсткого диска, маркованого як «200 Гб», в дійсності складає 186,2 ГіБ.
Фізичний розмір(форм-фактор) — майже всі сучасні накопичувачі для персональних комп'ютерів і серверів мають розмір або 3,5, або 2,5 дюйма. Останні частіше застосовуються в ноутбуках. Інші розповсюджені формати — 1,8 дюйма, 1,3 дюйма і 0,85 дюйма
Час доступу(англ.random access time) — від 3 до 15 мс, як правило, мінімальним часом відрізняються серверні диски(наприклад, у Hitachi Ultrastar 15K147 — 3,7 мс[2]), максимальним із актуальних - диски для портативних пристроїв(Seagate Momentus 5400.3 — 12, 5[3]).
Швидкість обертання диску(англ.spindle speed) — кількість оборотів шпинделя у хвилину.Від цього параметра в значній мірі залежать час доступу й швидкість передачі даних.У цей час випускаються вінчестери з наступними стандартними швидкостями обертання: 4200, 5400(ноутбуки), 7200(персональні комп'ютери), 10 000 і 15 000 об./хв. (сервери і високопродуктивні робочі станції).
Надійність(англ.reliability) — визначається як середній час наробітку на відмову(Mean Time Between Failures, MTBF).Див.також Технологія SMART. (S.M.A.R.T. (англ.Self Monitoring Analysing and Reporting Technology) — технологія оцінки стану жорсткого диска вбудованими апаратурами самодіагностики, а також механізм оцінки часу виходу його з ладу.)
Кількість операцій вводу - виводу на секунду — у сучасних дисків це близько 50 оп./ сек при довільному доступі до накопичувача й біля 100 оп./ сек при послідовному доступі.
Рівень шуму — шум, що відтворює механіка накопичувача при його роботі.Вказується в децибелах.Тихими накопичувачами вважаються пристрої з рівнем шуму близько 26 дб і нижче.
Опірність ударам(англ.G - shock rating) — опірність накопичувача різким перепадам тиску або ударам, виміряється в одиницях припустимого перевантаження g у включеному й виключеному стані.
Швидкість передачі даних(англ.Transfer Rate):
•	Внутрішня зона диска: від 44, 2 до 74, 5 Мб / с
•	Зовнішня зона диска: від 74, 0 до 111, 4 Мб / с
Історія прогресу накопичувачів
•	1956 — продаж першого комерційного жорсткого диска, IBM 350 RAMAC, 5 Мб. Він важив біля тони, займав два ящики — кожен розміром з великий холодильник, а загальний обсяг пам'яті 50 покритих чистим залізом, що оберталися в ньому, тонких дисків діаметром з велику піцу становив 5 мегабайт
•	1980 — перший 5,25-дюймовий Winchester, Shugart ST-506, 5 Мб
•	1986 — Стандарт SCSI
•	1991 — Максимальна ємність 100 Мб
•	1995 — Максимальна ємність 2 Гб
•	1997 — Максимальна ємність 10 Гб
•	1998 — Стандарти UDMA/33 й ATAPI
•	1999 — IBM випускає Microdrive ємністю 170 й 340 Мб
•	2002 — Узятий бар'єр адресного простору вище 137 Гб
•	2003 — Поява SATA
•	2005 — Максимальна ємність 500 Гб
•	2005 — Стандарт Serial ATA 3G
•	2005 — Поява SAS (Serial Attached SCSI)
•	2006 — Застосування перпендикулярного методу запису в комерційних накопичувачах
•	2006 — Поява «гібридних» жорстких дисків, що містять додатковий блок флеш-пам'яті ємністю в одиниці гігабайт
•	2007 — Hitachi представляє накопичувач ємністю 1 Тб
•	2009 — Western Digital представляє накопичувач з ємністю 2 Тб
Будова жорсткого диска
Основним пристроєм зберігання інформації у комп'ютерній системі є жорсткий диск. Великий обсяг і енергонезалежність зробили його найбільш придатним для зберігання програм і даних.
Повна назва жорсткого диска — НЖМД — накопичувач на жорстких магнітних дисках.
Накопичувач на жорсткому диску зовні являє собою міцний металевий корпус. Він абсолютно герметичний і захищає дисковод від часточок пилу, які, потрапивши у вузький зазор між головкою й поверхнею диска, можуть пошкодити чутливий магнітний шар і вивести диск із ладу. Крім того, корпус екранує накопичувач від електромагнітних перешкод.
Усередині корпуса знаходяться всі механізми і деякі електронні вузли.
Механізми — це самі диски, на яких зберігається інформація, головки, що записують і зчитують інформацію з дисків, а також двигуни, що рухають весь пристрій.
Диск —це кругла металева пластина з дуже рівною поверхнею, вкрита тонким феромагнітним шаром. У багатьох накопичувачах використовується шар оксиду заліза (яким вкривається звичайна магнітна стрічка), але новітні моделі жорстких дисків працюють із шаром кобальту завтовшки приблизно в десять мікронів. Таке покриття більш міцне і, крім того, дозволяє значно збільшити Щільність запису. Технологія його нанесення близька до тієї, що використовується при виробництві інтегральних мікросхем.
Кількість дисків може бути різною — від одного до п'яти, кількість робочих поверхонь, відповідно, удвічі більшою (по дві на кожному диску). Останнє (як і матеріал, використаний для магнітного покриття) визначає об’єм жорсткого диска. Іноді зовнішні поверхні крайніх дисків (або одного з них) не використовуються, що дозволяє зменшити висоту накопичувача, але при цьому кількість робочих поверхонь зменшується й може виявитися непарною.
Магнітні головки зчитують і записують інформацію на диски. Принцип запису загалом схожий на той, що використовується у звичайному магнітофоні. Цифрова інформація перетворюється на змінний електричний струм, що надходить на магнітну головку, а потім передається на магнітний диск, але вже у вигляді магнітного поля, яке диск може сприйняти і «запам'ятати».
Магнітне покриття диска являє собою безліч дрібних областей довільної (спонтанної) намагніченості. Для наочності уявіть собі, що диск вкритий шаром дуже маленьких стрілок від компаса, спрямованих у різні сторони. Такі частинки-стрілки називаються доменами. Під впливом зовнішнього магнітного поля власні магнітні поля доменів орієнтуються відповідно до його напрямку. Після припинення дії зовнішнього поля на поверхні диска утворюються зони 1 залишкової намагніченості. У такий спосіб зберігається записана на диск інформація. Ділянки залишкової намагніченості, опинившись при обертанні диска І напроти зазору магнітної головки, викликають у ній електрорушійну силу, яка змінюється в залежності від величини намагніченості. Пакет дисків, змонтований на осі-шпинделі, рухається спеціальним двигуном, компактно розташованим під ним. Швидкість обертання дисків, як правило, складає 5400 об/хв, хоча існують диски і зі швидкістю обертання 7200, 10000 і навіть 15000 об/хв. Для того щоб скоротити час виходу накопичувача в робочий стан, двигун при вмиканні якийсь час працює у форсованому режимі. Тому джерело живлення комп'ютера повинно мати запас пікової потужності.
Тепер про роботу головок. Вони переміщаються за допомогою прецизійного крокового двигуна і ніби «пливуть» на відстані в частки мікрона від поверхні диска, не торкаючись його. На поверхні дисків у результаті запису інформації утворюються намагнічені ділянки, у формі концентричних кіл. Вони називаються магнітними доріжками. Переміщаючись, головки зупиняються над кожною наступною доріжкою. Сукупність доріжок, розташованих одна під одною на всіх поверхнях, називають циліндром. Усі головки накопичувача перемішаються одночасно, здійснюючи доступ до однойменних циліндрів з однаковими номерами.
 
Інтерфейси
Для того щоб обмінюватися даними з комп'ютером, жорсткий диск підключений кабелями управління, за допомогою яких передаються команди диску й дані. Розглянемо різні інтерфейси підключення жорстких дисків.
IDE/ATA
IDE (Integrated Drive Electronics) — це назва типу жорстких дисків, шо мають інтерфейс ATA (AT Attachment). Дешева електроніка IDE у поєднанні з паралельною передачею даних АТА дозволяє виробляти жорсткі диски, ціна яких не надто висока. Проте не слід забувати, що АТА не призначений для зовнішніх підключень і не підтримує кабелів завдовжки більше 60 см.
Один канал АТА може підтримувати до двох дисків, первинний — master
вторинний — slave. Дуже часто ставлять на один канал жорсткий диск як master й інший, повільніший пристрій, типу CD-ROM, як slave. Але оскільки IDE може звертатися тільки до одного пристрою на каналі одночасно, то знижується продуктивність системи загалом. Так що краще не мати slave-пристроїв у принципі. Тим більше, що зараз усі материнські плати мають два інтегровані канали IDE, а деякі три і навіть чотири. Якщо є можливість, то краше підключати жорсткий диск як master на перший канал, a DVD або CD-ROM — як master на другий канал.
Сьогодні на ринку присутні чотири основні стандарти IDE-дисків: АТА/33, АТА/66, АТА/100. У цьому випадку число показує максимальну пропускну здатність у мегабайтах у секунду. Для АТА/66 і АТА/100 потрібен спеціальний gO-контактний кабель, а зі стандартним 40-контактним АТА/66/100 диск буде працювати, як АТА/33. Як правило, такий кабель іде в комплекті з усіма материнськими платами, що підтримують АТА/66/100. Ці три стандарти називають одним словом — UDMA. Хоча іноді й вживають UDMA, АТА і IDE як взаємозамінні поняття, але це неправильно.
Усі IDE-диски повинні працювати з усіма варіантами АТА. Диск АТА/100 повинен прекрасно функціонувати з контролером АТА/33, а диск АТА/33 повинен так само прекрасно працювати з контролером АТА/100. Але працювати вінчестер буде на швидкості найповільнішого компонента. В обох наведених випадках це буде швидкість АТА/33, тобто максимальна пропускна здатність дорівнюватиме 33 МБ/с. Іноді можуть виникнути певні несумісності, наприклад, коли конкретний диск не бажає працювати з конкретним кабелем або два диски від різних виробників не бажають співіснувати на одному каналі контролера.
Насправді різниця в продуктивності між АТА/33,66 і 100 не така вже й велика, тому що йдеться про пікову пропускну здатність, яка під час реальної роботи досягається дуже рідко Поки не існує дисків АТА/100, що забезпечують передачу даних навіть у 66 МБ/с, і лише деякі моделі досягли планки в 33 МБ/с. Тільки кеш-пам'ять жорсткого диска може скористатися перевагами підвищеної пропускної здатності. Але для цього розмір кеша повинен бути досить великим. А більшість IDE-дисків має всього 512 КБ кеш-пам'яті, і тільки деякі, найдорожчі, можуть похвалитися кешем у 2 або навіть 4 МБ.
Так що головним недоліком IDE, як і раніше, залишається мала швидкість. Звичайно, сучасні IDE-диски наздогнали за швидкісними характеристиками старі моделі SCSI-дисків, але з новими SCSI-вінчестерами їм все одно не зрівнятися. Можна придбати досить швидкий IDE-диск зі швидкістю обертання 7200 обертів на хвилину (грт), але можна купити і SCSI-привод зі швидкістю 15, 000 rpm, який буде більш швидким. Крім того, час напрацювання на відмову, що заявляється виробниками, у IDE-дисків набагато менший, ніж у SCSI-дисків. Можливо, це просто маркетингові заходи, але розповсюджена думка, що SCSI-пристрої надійніші, ніж IDE.
Майбутнє АТА, найімовірніше, належить стандарту Serial ATA. Serial ATA матиме кабель усього з двома контактами (один на прийом, один на передачу) і повинен забезпечити IDE пропускну здатність до 1.5 ГБ/с, а можливо, і більше. Це вдвічі перекриває пропускну здатність АТА/100, у якого контактів у 40 разів більше. Єдиною негативною стороною Serial ATA є те, що на одному каналі може бути тільки один пристрій, але при наявності контролера з декількома каналами це не проблема.
SCSI
SCSI давно став стандартним інтерфейсом для діючих станцій і серверів І хоча за ціною SCSI обходиться значно дорожче IDE, за ці гроші ми одержуємо набагато більшу пропускну здатність, підтримку більшої кількості пристроїв на одному каналі, набагато більшу довжину кабелів (до 12 м), підтримку зовнішніх пристроїв і багатозадачність.
Звичайна (іноді говорять «вузька») шина SCSI може нести на собі до 8 при строїв, а широка (wide) — до 16. Сам SCSI-контролер займає одну адресу, а інші 15 залишає для пристроїв, що підключаються (відповідно на вузькій шині для пристроїв залишається 7 адрес). Старші адреси SCSI мають більший пріоритет Це трохи ускладнює установку SCSI. Зазвичай краше надати пріоритет повшь ним пристроям, типу CD-ROM, а не жорстким дискам.
Існує безліч різних варіантів SCSI. З доступних зараз пристроїв можна назвати Ultra, Ultra2 і UltragО SCSI Ultra SCSI дозволяє передачу 20 МБ/с і має 8 адрес. Широка (wide) версія Ultra SCSI піднімає пропускну здатність удвічі, тобто до 40 МБ/с. Ultra2 SCSI, відомий також як LVD (Low Voltage Differential) SCSI, має пропускну здатність 40 МБ/с, і, відповідно, wide-версія його дає нам 80 МБ/с. Ultral60 SCSI продовжує традицію подвоєння пропускної здатності, але буває тільки у варіанті wide, що дає нам 16 пристроїв на каналі й 160 МБ/с SCSI-пристрої, як правило, мають сумісність зверху вниз. Правда, цього ніхто не гарантує, але в більшості випадків, наприклад, пристрій SCSI-2 буде прекрасно себе почувати на контролері Ultra2Wide SCSI. Однак при цьому буває, що за наявності на одній шині швидкого і повільного пристроїв обидва починають працювати з максимальною швидкістю повільного. Але насправді те, як будуть поводитися різні SCSI-пристрої, підвішені поруч, залежить в основному від контролера.
Із SCSI часто виникають проблеми, що стосуються установки і першого настроювання, особливо в тих, хто робить це вперше Одночасно усі ці проблеми з лихвою окупаються надійністю цього інтерфейсу. А поява активних терміна торів (тобто пристроїв, які обов'язково повинні завершувати ланцюжок SCSI пристроїв) помітно спростила установку SCSI- пристроїв
Головна перевага SCSI виражається терміном high-end, тобто більш швидкі, найбільш об'ємні жорсткі диски мають інтерфейс SCSI Наприклад, Seagate Cheetah з 15 000 обертів на шпинделі у варіанті IDE ніколи не вироблявся і навряд чи буде вироблятися. Натомість здатність підтримувати до 15 пристроїв на одному каналі говорить про чудове масштабування, що для повних цілей теж дуже важливо.
Майбутнє SCSI уже розписане як по нотах З'являються перші пристрої Ultra 320. і наступним кроком буде Ultra 640. Сам стандарт SCSI напочатку передбачав масштабування і став масштабований настільки, що навряд чи щось може з ним у цьому зрівнятися.
Fibre channel (оптоволоконний канал)
Fibre channel — це інтерфейс, шо докорінно відрізняється від SCSI і IDE Узагалі він ближчий до Ethernet і InfiniBand. Коротко кажучи, цей інтерфейс призначений не тільки для того, щоб приєднувати жорсткі диски й іншу периферію до системи, а насамперед для організації мереж, об'єднання віддалений один від одного масивів жорстких дисків й інших операцій, що вимагають високої пропускної здатності в поєднанні з великими відстанями. Fibre channel часто використовується для з'єднання SCSI RAID- масивів із мережею робочої групи або сервером.
Існуючі технології дозволяють пропускну здатність Fibre channel у 100 МБ/с, а теоретична межа цієї технології лежить десь у районі 1.06 ГБ/с. При цьому вже зараз ряд компаній зайнятий розробкою пристроїв із пропускною здатністю до 2.12 ГБ/с, але це вже наступне покоління інтерфейсу Fibre channel. На сьогоднішньому ринку також присутні рішення, коли для досягнення надвисокої пропускної здатності використовується цілий ряд каналів Fibre channel одночасно.
На відміну від SCSI, Fibre channel має набагато більшу гнучкість. Якщо SCSI обмежується всього 12 м, то Fibre channel дозволяє з'єднання завдовжки до 10 км при використанні оптичного кабелю і трохи менше при використанні порівняно недорогих мідних сполук.
IEEE 1394
IEEE 1394, він же FireWire (як його назвала Apple), він же iLink (як його назвала Sony), реально стає стандартом для передачі цифрового відео, але також може використовуватися для підключення жорстких дисків, сканерів, мережного устаткування, цифрових камер і всього, що вимагає високої пропускної здатності Сьогодні FireWire залишається досить дорогим рішенням (принаймні, для рядового користувача), але стандарт дедалі більше проникає в усі сфери комп'ютерної периферії і постійно дешевшає.
FireWire здатний підтримувати до 63 пристроїв на одному каналі 400 МБ/с. A IEEE 1394b, перша спроба серйозного перегляду FireWire, підтримуватиме пропускну здатність у 800 МБ/с на канал. FireWire забезпечує велику продуктивність, але зовнішні пристрої з цим інтерфейсом потребують окремого зовнішнього джерела живлення.
Перші жорсткі диски FireWire уже починають з'являтися, і вже досить давно існують моделі, які використовують транслятор IDE/FireWire. А от для відеокамер, сканерів і принтерів цей інтерфейс використовується вже дуже широко. Також на базі FireWire можна будувати продуктивні локальні мережі. Багато моделей комп'ютерів Apple мають один або два FireWire-порти, однак на PC пей стандарт поки такого визнання не одержав.
Найприємнішою особливістю FireWire є можливість «гарячого» підключення. Тобто можна підключати й відключати FireWire-пристрої, не вимикаючи комп'ютер. Але якщо таким пристроєм є жорсткий диск, то операційна система повинна вміти монтувати нові жорсткі диски «на льоту».
Майбутнє IEEE 1394 виглядає досить оптимістично, з огляду на молодість Цього стандарту і вже майже готову специфікацію 1394b, що дозволяє подвоїти пропускну здатність. А визнання цього стандарту — справа недалекого майбутнього, популярність його зростає з кожним днем, а ціни, відповідно, падають.
USB
USB (Universal Serial Bus — універсальна послідовна шина) — стандарт, що одержав за останні кілька років дуже широке поширення. Складно знайти комп'ютер, на якому б не було підтримки USB. Цей інтерфейс має два швидкісні 1 режими. Перший — «високошвидкісний» — забезпечує пропускну здатність у 1 12 МБ/с і довжину з'єднувальних кабелів до 5 м. Другий — низькошвидкісний — J пропускну здатність 1.5 МБ/с і довжину кабелів до 3 м. Зрозуміло, що для і жорстких дисків цей стандарт непридатний через свою повільність, а от для І усіляких пристроїв резервного копіювання, CD-R, сканерів, мережних пристроїв 1 і пристроїв введення цілком підходить.
На одному каналі USB може бути до 127 пристроїв, для чого можуть використовуватися-пристрої, що пропускають через себе сигнал, або USB-концентра- і тори. USB має так званий майстер-контролер, так що будь-який сигнал, переданий, скажімо, від USB- жорсткого диска до USB CDR, повинен пройти через контролер, а вже потім надійти до необхідного пристрою. Це дуже знижує пропускну здатність при використанні декількох USB-пристроїв. Крім того, USB-пристрої не можуть використовуватися кількома комп'ютерами одночасно (у і мережі, наприклад), хоча два комп'ютери можна з'єднати між собою USB-мережею через USB-міст.
Зате при усіх своїх мінусах USB дозволяє «гаряче» підключення. Правда, І операційна система все одно зажадає від вас драйвер нового пристрою, але пере-завантажувати комп'ютер не доведеться.
Сьогодні великого поширення набуває стандарт USB 2.O. Він піднімає планку пропускної здатності з 12 до 480 МБ/с. Це дозволяє використовувати USB 2.0 для підключення зовнішніх жорстких дисків, і такі диски вже з'явилися.
Який інтерфейс вибрати
Насправді вибір уже визначений вашою метою. Якщо ви збираєте домашній комп'ютер для ігор або для офісної роботи, то IDE-диск дасть вам найкращу комбінацію ціна/продуктивність. USB добре підійде для зовнішнього CDR або стрічкового накопичувача для резервного копіювання (якщо копіювати не занадто багато). Якщо вам потрібен швидкий зовнішній диск для підключення до ноутбука або для регулярного перенесення між декількома комп'ютерами і основною вимогою, крім мобільності, є продуктивність, то ваш вибір — IEEE 1394. Якщо йдеться про оснащення серйозної робочої станції або сервера, де критичними є надійність і продуктивність, то кращий вибір — SCSI, особливо у формі RAID, хоча це й коштує досить дорого. Якщо ви формуєте кластер автоматизованих робочих місць, яким необхідний високошвидкісний доступ до великого масиву даних, то Fibre channel забезпечить вам швидкість; віддаленість робочих місць від масиву інформації практично не має значення. Інша можливість полягає в створенні мережі Gigabit Ethernet, а для сервера, як правило, вибирають рішення RAID SCSI; для некритичних серверів — IDE RAID.
RAID
RAID розшифровується як Redundant Array of Inexpensive Disks, або по-українськи — надлишковий масив недорогих дисків. RAID переслідує дві основні мети: підвищити швидкість і/або надійність. Існує досить багато типів RAID, але основні — це RAID 0, 1 і 0+1. RAID 0 дозволяє об'єднати обсяг двох дисків у єдине ціле, так що операційна система буде бачити їх і використовувати як один фізичний диск RAID 1 дозволяє створювати «дзеркало», тобто інформація пишеться відразу як на один, так і на другий диск, і у випадку, якщо перший, основний, диск вийде з ладу, то всі дані на другому будуть збережені повністю. Ну і, нарешті, RAID 0+1 використовує одночасно два описані вище режими (не забувайте, що при цьому потрібно, як мінімум, чотири жорсткі диски, два зливаються в масив і два використовуються для «дзеркала»). Є ще інші варіанти RAID для підвищення надійності зберігання інформації, типу парності, для перевірки цілісності даних.
 
Зберігання інформації
Зберігання і читання даних з диска вимагає взаємодії між операційною системою, контролером жорсткого диска й електронними й механічними компонентами самого нагромаджувача. Операційна система поміщає дані на зберігання й обслуговує каталог секторів диска,, закріплених за файлами. Коли ви даєте системі команду зберегти файл або прочитати його з диска, вона передає її у контролер жорсткого диска, який переміщає магнітні головки до таблиці розташування файлів відповідного логічного диска. Потім операційна система зчитує цю таблицю, здійснюючи в залежності від команди пошук вільного сектора диска, у якому можна зберегти новий створений файл, або початок призначеного для зчитування файла.
Інформація таблиці розміщення файлів надходить з електронної схеми нагромаджувача в контролер жорсткого диска і повертається операційній системі, після чого ОС генерує команду установки магнітних головок над відповідною доріжкою диска для запису або зчитування потрібного сектора. Записавши новий файл на вільні сектори диска, ОС повертає магнітні головки в зону розташування таблиці і вносить у неї зміни, послідовно перераховуючи всі сектори, на яких записаний файл.
Адресація секторів
Жорсткий диск, як і будь-який інший блоковий пристрій, зберігає інформацію фіксованими порціями, що називаються блоками. Блок є найменшою порцією даних, що має унікальну адресу на жорсткому диску. Для того щоб прочитати або записати необхідну інформацію в потрібне місце, треба представити адресу блока як параметр команди, що видається контролеру жорсткого диска. Розмір блока вже віддавна є стандартним для усіх жорстких дисків — 512 байт. На жаль, досить часто відбувається плутанина між такими поняттями, як «сектор», «кластер» і «блок». Фактично між «блоком» і «сектором» різниці немає. Правда, одне поняття логічне, а друге топологічне. «Кластер» — це кілька секторів, які операційна система розглядає як одне ціле.
Чому ж відмовилися від простої роботи із секторами? Перехід до кластерів відбувся тому, що розмір таблиці розміщення файлів був обмежений, а розмір Диска збільшувався. Наприклад, у файловій системі FAT16 для диска об'ємом 512 МБ кластер буде складати 8 КБ, до 1 ГБ — 16 КБ, до 2 ГБ — 32 КБ і так Далі. Для того щоб однозначно адресувати блок даних, необхідно вказати всі три числа (номер циліндра, номер сектора на доріжці, номер головки). Такий спосіб адресації диска був широко розповсюджений і одержав згодом позначення абревіатурою CHS (cylinder, head, sector). Саме цей спосіб був спочатку реалізований у BIOS, тому згодом виникли обмеження, пов'язані з ним. Справа в тому, що BIOS визначив розрядну сітку адрес на 63 сектори, 1024 циліндри і 255 головок. Однак розвиток жорстких дисків у той час обмежувався використанням лише 16 головок у зв'язку зі складністю виготовлення. Звідси з'явилося перше обмеження на максимально припустиму для адресації ємність жорсткого диска: 1024x16x63x512 = 504 Мб.
Згодом виробники почали випускати HDD більшого розміру. Відповідно кількість циліндрів на них перевищила 1024, максимально допустиму кількість циліндрів (із погляду старих BIOS). Однак адресована частина диска продовжувала дорівнювати 504 Мб, за умови, що звертання до диска велося засобами BIOS. Це обмеження згодом було зняте введенням так званого механізму трансляції адрес.
Проблеми, що виникли з обмеженістю BIOS щодо частини фізичної геометрії дисків, призвели, зрештою, до появи нового способу адресації блоків на диску. Цей спосіб досить простий. Блоки на диску описуються одним параметром — лінійною адресою блока. Адресація диска лінійно одержала абревіатуру LBA (logical block addressing). Лінійна адреса блока однозначно пов'язана з його CHS-адресою:
Іbа = (Циліндр х Всього Головок + Головка) х Секторів + (Сектор-1). Введення підтримки лінійної адресації у контролери жорстких дисків дало можливість BIOS зайнятися трансляцією адрес. Суть цього методу полягає в тому, що якщо в наведеній вище формулі збільшити параметр Всього Головок, то буде потрібно менше циліндрів, щоб адресувати ту ж саму кількість блоків диска. Але зате буде потрібно більше головок. Однак головок використовувалося всього 16 з 255. Тому BIOS почали переводити надлишкові циліндри в головки, зменшуючи кількість одних і збільшуючи кількість інших. Це дозволило їм використовувати розрядну сітку головок повністю і відсунуло межу адресованого BIOS дискового простору до 8 ГБ.
Не можна не сказати кілька слів і про Large Mode. Цей режим роботи призначений для роботи жорстких дисків обсягом до 1 ГБ. У Large Mode кількість логічних головок збільшується до 32, а кількість логічних циліндрів зменшується вдвічі. При цьому звертання до логічних головок 0 F транслюються в парні фізичні циліндри, а звертання до головок 10 IF — у непарні. Вінчестер, розмічений у режимі LBA, несумісний з режимом Large, і навпаки.
Подальше збільшення адресованих об'ємів диска з використанням колишніх сервісів BIOS стало принципово неможливим. Справді, всі параметри задіяні за максимальною «планкою» (63 сектори, 1024 циліндри і 255 головок). Тоді був розроблений новий розширений інтерфейс BIOS, що враховує можливість дуже великих адрес блоків. Однак цей інтерфейс уже не сумісний з колишнім, унаслідок чого старі операційні системи, такі як DOS, що користуються старими інтерфейсами BIOS, не змогли і не зможуть переступити межу в 8 ГБ.
Практично всі сучасні системи вже не користуються BIOS, а використовують власні драйвери для роботи з дисками. Тому це обмеження на них не поширюється. Але слід розуміти, що, перш ніж система зможе використовувати власний драйвер, вона повинна, як мінімум, його завантажити. У зв'язку з цим на етапі початкового завантаження будь-яка система змушена користуватися BIOS. Це викликає обмеження на розміщення багатьох систем за межами 8 ГБ, вони не можуть звідтіля завантажуватися, але можуть читати й писати інформацію (наприклад DOS, який працює з диском через BIOS).
Розділи
Розглянемо розміщення операційних систем на жорстких дисках. Для організації систем дисковий адресний простір блоків ділиться на частини, що називаються розділами (partitions) Розділи повністю подібні до цілого диску в тому, що вони складаються із суміжних блоків. Завдяки такій організації для опису розділу досить указати початок розділу і його довжину в блоках Жорсткий диск може містити чотири первинні розділи.
Під час завантаження комп'ютера BIOS завантажує перший сектор головного розділу (завантажувальний сектор) і передає йому управління. На початку цього сектора розташований завантажник (завантажувальний код), що прочитує таблицю розділів і визначає завантажувальний розділ (активний). А далі все повторюється Тобто він завантажує завантажувальний сектор цього розділу на цю ж адресу і знову передає йому управління.
Розділи є контейнерами усього свого вмісту. Цим вмістом є. як правило, файлова система Під файловою системою, з точки зору диска, мається на увазі система розмічання блоків для зберігання файлів. Після того як на розділі створена файлова система й у ній розміщені файли операційної системи, розділ може стати завантажувальним Такий розділ має у своєму першому блоці невелику програму, що здійснює завантаження операційної системи. Однак для завантаження певної системи потрібно запустити її завантажувальну програму з першого блоку
Розділи з файловими системами не повинні перетинатися. Це пов'язано з тим, що дві різні файлові системи мають кожна своє уявлення про розміщення файлів, але коли це розміщення припадає на одне й те фізичне місце на диску, між файловими системами виникає конфлікт. Цей конфлікт виникає не відразу, а лише в міру того, як файли починають розміщатися в тому місці диска, де розділи перетинаються Тому треба уважно ставитися до розмічання диска на розділи.
Само по собі перетинання розділів нічим не загрожує. Але небезпечним є саме розміщення декількох файлових систем на перехресних розділах. Розмічання диска на розділи ще не означає створення файлових систем. Однак уже сама спроба створення порожньої файлової системи (тобто форматування) на одному з перехресних розділів може призвести до виникнення помилок у файловій системі іншого розділу Усе сказане стосується однаковою мірою всіх операційних систем, а не тільки найпопулярніших.
Диск розбивається на розділи за програмою, тобто ви можете створити довільну конфігурацію розділів Інформація про розмічання диска зберігається в першому блоці жорсткого диска, який називається головним завантажувальним записом (Master Boot Record (MBR))
Головний завантажувальний запис
MBR є основним засобом завантаження з жорсткого диска, що підтримується BIOS Тільки один із розділів диска мас право бути позначеним як активний, Що означатиме, що програма завантаження повинна завантажити в пам'ять перший сектор саме цього розділу і передати туди управління. Програма завантаження переглядає таблицю розділів, вибирає з них активний, завантажує перший блок цього розділу і передає туди управління
Розглянемо, як операційні системи класу MS-DOS і Windows 9x оперують із розділами. ОС забирає у своє користування два з чотирьох розділів: Primary DOS partition, Extended DOS partition. Перший з них (primary) одержує букву С Другий — це контейнер логічних дисків. Вони усі знаходяться там у вигляді ланцюжка підрозділів, які так і іменуються: D:, Е: і т. д. Логічні диски можуть мати і сторонні файлові системи, відмінні від файлової системи FAT. яка застосовується в DOS/Windows 9x. Однак, я-к правило, сторонність файлової системи пов'язана з присутністю ще однієї операційної системи, яку, узагалі кажучи, варто було б помістити у свій власний розділ (не extended DOS), але для таких дій часто виявляється занадто маленькою таблиця розділів.
Відзначимо ще одну важливу обставину. Коли на чистий жорсткий диск установлюється DOS/Windows 9х, то при завантаженні немає ніяких альтернатив v виборі операційних систем. Тому завантажувач виглядає досить примітивно, йому не треба запитувати в користувача, яку систему той хоче завантажити. З бажанням мати відразу кілька систем виникає необхідність заводити програму, яка дозволяє вибирати систему для завантаження.
В операційних системах Windows NT/2000/XP завантажувач міститься в зaвантажувальному записі активного розділу. У завантажувачі передбачена можливість вибору як завантажувальної операційної системи, так і розділу, де вона знаходиться. За розділами в операційній системі також закріплюються певні букви, однак вони можуть бути змінені користувачем.
 

";
            textBox1.Text += Environment.NewLine + four + Environment.NewLine;
        }
        private void button10_Click(object sender, EventArgs e)
        {
            textBox1.Text = "";
            ten();
        }
        void ten()
        {
            string four = @"
BIOS (Basic Input Output System) - базовая система ввода-вывода. Это часть программного обеспечения PC, поддерживающая управление адаптерами внешних устройств, экранные операции, тестирование, начальную загрузку и установку OS. BIOS - это стандартный интерфейс, обеспечивающий переносимость OS между PC с одинаковым микропроцессором. BIOS хранится в ПЗУ PC. 
Система BIOS в PС реализована в виде одной микросхемы, установленной на материнской плате компьютера. В настоящее время применяются в основном перепрограммируемые запоминающие устройства. Наиболее перспективным для хранения системы BIOS является сейчас флэш-память. Это позволяет легко модифицировать старые или добавлять дополнительные функции для поддержки новых устройств, подключаемых к компьютеру.
Термин *BIOS* употребляется по отношению к устройствам, совместимым с персональными компьютерами фирмы IBM. Для устройств, построенных на базе иных платформ, используются другие термины. Например, для компьютеров архитектуры SPARC набор микропрограмм может называться *PROM* или *Boot*.
Русское название *БИОС* произошло из транслитерации английской аббревиатуры *BIOS*. Произносят *би́ос*. Надо помнить, что это русифицированное, искажённое произношение и правильно произносить это название как *ба́йос* (/ˈbaɪ.ɒs/). Правильное название базовой системы ввода-вывода — именно *байос* — позволяет избежать путаницы с BeOS (операционная система, созданная фирмой *Be, Inc.*; произносится *би́-ос*) и с другими похожими по написанию или звучанию словами.
В IBM PC-совместимом компьютере, использующем микроархитектуру x86, код BIOS хранится на микросхеме EEPROM (ЭСППЗУ — электрически стираемое перепрограммируемое постоянное запоминающее устройство).
Назначение BIOS:
●проверка    работоспособности оборудования;
● загрузка операционной системы (ОС);
● предоставление API для работы с оборудованием;
● настройка оборудования.

После включения IBM PC-совместимого компьютера процессор, реализующий микроархитектуру x86, читает код BIOS из ПЗУ (с микросхемы EEPROM), записывает его в ОЗУ (оперативную память) и передаёт управление коду BIOS.
Затем код BIOS:
●выполняет тестирование оборудования компьютера (POST, англ. power-on self-test);
● читает настройки из энергонезависимого ПЗУ;
● применяет настройки;
● ищет и загружает в оперативную память код загрузчика;
● передаёт управление загрузчику.
Таким образом BIOS обеспечивает начальную загрузку IBM PC-совместимого компьютера.
В дальнейшем загрузчик ищет и загружает в память код операционной системы и передаёт ему управление.
BIOS реализует API для работы с внутренними и внешними устройствами компьютера. Загрузчик ОС и сама ОС используют это API для работы с оборудованием до тех пор, пока не загрузят собственные драйверы.
Инициализация и проверка работоспособности аппаратуры
Бо́льшую часть кода BIOS составляют микропрограммы, предназначенные для инициализации контроллеров, расположенных на материнской плате, и устройств, подключённых к материнской плате (которые, в свою очередь, могут иметь контроллеры с собственными BIOS).
Сразу после включения питания компьютера процессор читает код BIOS из EEPROM, записывает код BIOS в память и передаёт ему управление. Первым делом код BIOS начинает проверку аппаратного обеспечения компьютера — POST. В ходе POST код BIOS проверяет работоспособность контроллеров, расположенных на материнской плате, задаёт низкоуровневые параметры их работы (например, частоту шины и параметры центрального микропроцессора, контроллера оперативной памяти, контроллеров шин FSB, AGP, PCI, USB).
Если во время POST случится сбой, код BIOS может выдать информацию, позволяющую выявить причину сбоя. Кроме вывода сообщения на монитор (а также в случаях, если нет возможности вывести сообщение на монитор), используется звуковой сигнал, воспроизводимый при помощи встроенного динамика (спикера).
Загрузка операционной системы
Если POST выполнен без ошибок, код BIOS начнёт поиск кода загрузчика ОС. Поиск выполняется на доступных и разрешённых в настройках носителях:
● в главной загрузочной записи (англ. master boot record, MBR) 
● на hdd или ssd;
● на USB-flash;
● на оптическом диске CD-ROM;
●  на дискете (англ. floppy disk);
● в сети с использованием технологии PXE.
Код BIOS загрузит код загрузчика ОС в память и передаст ему управление.
Загрузчик ОС и сама ОС по ходу работы могут изменять большинство настроек, установленных кодом BIOS.
Некоторые реализации BIOS поддерживают загрузку через интерфейсы, изначально для этого не предназначенные (USB и IEEE 1394).




";
            textBox1.Text += Environment.NewLine + four + Environment.NewLine;
        }
        private void button11_Click(object sender, EventArgs e)
        {
            textBox1.Text = "";
            eleven();
        }
        void eleven()
        {
            string four = @"Системний блок — корпус комп'ютера, функціональний елемент, який захищає внутрішні компоненти комп'ютера від зовнішнього впливу та механічних пошкоджень, підтримує необхідний температурний режим в середині системного блоку, екранує створені внутрішніми компонентами електромагнітні випромінення та є основою для подальшого розширення системи. Системні блоки зазвичай виробляються з деталей на основі сталі, алюмінію та пластмаси, також інколи використовують такі матеріали, як деревина та органічне скло.
Типи корпусів

Горизонтальні:
Desktop (533×419×152 мм)
FootPrint (406×406×152 мм)
SlimLine (406×406×101 мм)
UltraSlimLine (381×352×75 мм)
Вертикальні:
MiniTower (152×432×432 мм)
MidiTower (173×432×490 мм)
BigTower (190×482×820 мм)
SuperFullTower (різні розміри
Для підвищення уваги до проблем захисту довкілля був придуманий корпус з гофрокартону.
Системний блок можна назвати найголовнішим пристроєм комп’ютера. Від його характеристик залежить швидкодія комп’ютера,  його надійність та інші властивості. Зазвичай системний блок є найдорожчою частиною комп’ютера. Системний  блок  зовні  схожий  до  металевий  ящик. У ньому містяться процесор, пам’ять, вінчестер  (жорсткий  магнітний  диск),  DWD-привід (пристрій для роботи з лазерними дисками).
Отже, в корпусі системного блока розташовані:

■  блок електричного живлення;

■  материнська плата, на якій знаходяться процесор, оператив­на пам’ять, звукова, відео- та мережна карти;

■  допоміжні  відділення,  в  яких  знаходяться  вінчестер,  пристрій для читання та запису дисків;

■  передня панель,  на якій  знаходяться кнопки  ввімкнення та перезавантаження,  світлові  індикатори  (лампочки),  порти для USB підключень, навушників, мікрофона та ін. Слід зауважити, що порти (гнізда) для під’єднання кабелю живлення та більшості пристроїв знаходяться на задній стінці системного блоку.
";
            textBox1.Text += Environment.NewLine + four + Environment.NewLine;
        }

        private void button14_Click(object sender, EventArgs e)
        {
            checkBox1.Checked = false;
            checkBox2.Checked = false;
            checkBox3.Checked = false;
            checkBox4.Checked = false;
            checkBox5.Checked = false;
            checkBox6.Checked = false;
            checkBox7.Checked = false;
            checkBox8.Checked = false;
            checkBox9.Checked = false;
            checkBox10.Checked = false;
            checkBox11.Checked = false;
            checkBox12.Checked = false;
            checkBox13.Checked = false;
            checkBox14.Checked = false;
            checkBox15.Checked = false;
            checkBox16.Checked = false;
            //hjfgjghj
            textBox1.Text = "";
            checkBox1.Visible = false;
            checkBox2.Visible = false;
            checkBox3.Visible = false;
            checkBox4.Visible = false;
            checkBox5.Visible = false;
            checkBox6.Visible = false;
            checkBox7.Visible = false;
            checkBox8.Visible = false;
            checkBox9.Visible = false;
            checkBox10.Visible = false;
            checkBox11.Visible = false;
            checkBox12.Visible = false;
            checkBox13.Visible = false;
            checkBox14.Visible = false;
            checkBox15.Visible = false;
            checkBox16.Visible = false;
            //uifhuikgh
            

        }

        private void button18_Click(object sender, EventArgs e)
        {
            textBox1.Text = "";
            twelve();
        }
        void twelve()
        {
            string twelve = @"ВСТУП.
Запам'ятовуючі пристрої (ЗП) є важливою частиною мікропроцесорних систем (МПС). Вони призначені для запису, зберігання та читання, або тільки для зберігання та читання інформації поданої у вигляді двійкових кодових слів.
Розглянуті раніше регістри, побудовані на тригерах, використовуються для тимчасового зберігання та перетворення одного чи декількох кодових слів (наприклад, у надоперативній пам'яті мікропроцесора). Використання регістрів для зберігання великих масивів інформації виявилося занадто нераціональним через те, що при цьому ЗП стають громіздкими, а їх ціна надмірно збільшується. Це пояснює застосування у МПС запам'ятовуючих пристроїв, побудованих на інших принципах. Для зберігання великих обсягів інформації будують ЗП з використанням спеціальних мікросхем, у кожній з яких можуть знаходитись мільйони біт.
Дана лекція присвячена розгляду основних показників та класифікації ЗП, які застосовуються у МПС та вивченню принципів побудови та функціонування оперативних запам’ятовуючих пристроїв статичного та динамічного типів. Матеріал даного заняття важливий для розуміння принципів функціонування будь-якої МПС.
1. Класифікація запам’ятовувальних пристроїв.
У сучасній ПЕОМ машині пам'ять, поза всяких сумнівів, посідає друге за важливістю місце після процесору. Параметри оперативної пам'яті у значній мірі визначають ефективність виконання різноманітних задач. Підвищення технічних та експлуатаційних характеристик сучасних МПС (особливо їх можливостей що до розв'язання складних задач, які потребують обробки великих масивів інформації) перш за все пов'язано з підвищенням ємності та швидкодії ЗП. Адже не достатньо тільки мати потужну та швидкодіючу пам'ять; не менш важливим є створення *сприятливих умов* для максимального використання її потенційних можливостей.
Для пам’яті сучасних ПК характерний ієрархічний принцип побудови. Тобто, у складі підсистеми пам’яті повинні бути ЗП, яки виконують різні функції та побудовані на основі різних принципів, тому що вимоги до пристроїв пам’яті дуже суперечливі та не можуть бути виконані у єдиному пристрої.
За виконуваними функціями розрізняють такі типи ЗП:
- оперативні запам'ятовуючі пристрої (ОЗП, RAM – Random Access Memory);
- постійні запам'ятовуючі пристрої (ПЗП, ROM – Read Only Memory);
- зовнішні запам'ятовуючі пристрої (ЗЗП) або накопичувачі інформації.
Оперативний запам'ятовуючий пристрій -- це пам'ять комп'ютера, призначена для зберігання даних, адрес та програм, які використовує комп'ютер в даний момент часу. У комп'ютері ОЗП використовують як для зберігання програм і даних користувача, так і для зберігання системних програм і даних, які забезпечують власне функціонування самої обчислювальної машини. Сукупність останніх отримала назву операційної системи.
Постійні запам'ятовуючі пристрої призначені для зберігання певної одноразово записаної до них інформації, яка має зберігатися навіть за умов знеструмлення комп'ютеру. Такою інформацією є базові системні дані і програми, потрібні для завантаження операційної системи та керування роботою зовнішніх пристроїв комп'ютеру. Таким чином, постійний запам'ятовуючий пристрій -- це пам'ять комп'ютера, призначена для зберігання службових програм і даних, які не можуть бути змінені у процесі його роботи.
Зовнішня пам'ять може розглядатися як архівна пам'ять, призначена для довготермінового зберігання великих масивів інформації.
Підсумовуючи вищесказане, взаємодію типів ЗП можна зобразити схемою, що подана на рис.1.
За способом доступом до інформації розрізняють такі типи ЗП:
1. ЗП з довільним доступом до інформації;
2. ЗП з прямим доступом до інформації;
3. ЗП з послідовним доступом до інформації.
Довільний доступ до інформації передбачає можливість прямого безпосереднього звернення до будь-якої комірки пам'яті не залежно від місця її розташування у ЗП. Треба також зазначити, що при цьому час, потрібний для такого звернення теж не залежить від місця розташування відповідної комірки у масиві пам'яті.
Прямий доступ до інформації передбачає можливість також прямого безпосереднього звернення до будь-якої масиву (кластера) пам'яті не залежно від місця її розташування у ЗП.
Але ж час, потрібний для такого звернення залежить від місця розташування відповідного кластера у масиві пам'яті.
Послідовний доступ передбачає можливість звернення до комірок пам'яті тільки у порядку черги, тобто для запису чи читання будь-якої комірки треба перш за все *перегорнути* усі попередні комірки. Таку систему звернення можна порівняти із способом отримання доступу до певного запису на магнітофонній касеті. Перш ніж отримати його, треба перемотати касету до потрібного місця. Звичайно у цьому випадку неминучі великі витрати часу, тому такий метод доцільно застосовувати лише для архівних пристроїв зберігання даних на магнітній стрічці, які отримали назву стримерів.
За типом носіїв інформації розрізняють: напівпровідникові, магнітні та оптичні ЗП.
Напівпровідникові ЗП, побудовані з використанням біполярних та МОН (Метал-Окис-Напівпровідник) - транзисторів, використовують для реалізації швидкодіючої оперативної пам'яті, до якої висуваються досить високі вимоги. Ці пристрої використовують властивість деяких електронних пристроїв необмежений час знаходитись у одному з двох стійких станів (*0* або *1*) або зберігати певний електричний заряд, як ознаку запису у ЗП одного біту інформації. Постійні ЗП також напівпровідникові.
Магнітні ЗП використовують властивість тонких плівок, виготовлених з феросплаву на основі оксиду хрому, або кобальту (раніше використовувався оксид заліза) довгий час зберігати остаточну намагніченість після впливу на них магнітним полем. Невелика область магнітної поверхні (домен) під впливом магнітного поля впорядковує свої елементарні вектори намагнічування, що розглядається як запис одного біту інформації. До таких пристроїв найбільш важливою є велика інформаційна ємність та низька вартість зберігання одиниці інформації. Найбільшого розповсюдження набули накопичувачі на магнітних дисках (гнучких та жорстких) та магнітних стрічках.
Оптичні ЗП, або пристрої пам'яті на лазерних дисках використовують властивість фоточутливого шару, нанесеного на пластикову поверхню диску, змінювати колір або форму під впливом сильно сфокусованого лазерного променя. Наявність у цьому шарі, захищеному зверху шаром лаку, мікрозаглиблення або мікрокрапки іншого кольору після її експозиції променем лазеру, сприймається як запис одного біту інформації. У порівнянні з магнітними носіями інформації, лазерні диски є більш надійними і можуть зберігатися набагато довше.
Основними показниками ЗП є:
1.	Обсяг пам'яті пристрою, який характеризує його здатність зберігати велику кількість програм і даних.
2.	Розрядність пам'яті, яка визначає діапазон чисел, розміщених у комірках. Найбільш розповсюджена на даний момент розрядність -- 64 та 128. Цей показник тісно пов'язаний з розрядністю шини даних процесору, адже саме по цій шині інформація з пам'яті надходитиме до нього на обробку.
3.	Швидкодія пам'яті, яка характеризує витрати часу на занесення даних до неї (запис) та на отримання їх назад (читання). Діапазон цього показника досить широкий: від кількох мілісекунд для накопичувачів на жорстких дисках і до наносекунд для сучасних ОЗП.
4.	Енергоспоживання та геометричні розміри визначають ефективність використання того чи іншого типу пам'яті у конкретному обчислювальному пристрої. Особливо гостро стоїть проблема зниження розмірів та споживаної електроенергії для портативних переносних комп'ютерів, які мають працювати у автономному режимі 4-5 годин.
Поняття про адресну організацію ЗП
Запам’ятовувальні пристрої з довільним зверненням найчастіше мають адресну організацію. Масив ЗП складається з комірок, кожна з яких зображує групу запам’ятовувальних елементів, які призначена для зберігання двійкового слова визначеної розрядності (наприклад, байт). Кожній комірці масиву пам’яті присвоєна адреса, яким є її двійковий порядковий номер (звичайно, починаючи з 0). 

2. Оперативні запам’ятовувальні пристрої статичного типу.
Статична пам'ять (Static RAM -- SRAM) отримала свою назву через те, що кожен занесений до неї біт інформації може знаходитись там необмежений час без будь-якого поновлення. Єдиною умовою збереження інформації у статичних ЗП є постійна наявність електроживлення мікросхем пам'яті, тому вони, як і усі інші типи оперативної пам'яті, відносяться до енергозалежних пристроїв. При зникненні напруги живлення, уся інформація, що знаходилась у комірці такого типу пам'яті буде стерта.
Основою побудови статичних ЗП є простіші RS-тригери, реалізовані не у ТТЛ технології (яка є дуже енерговитратною) а у МОН. Наявність бістабільного елементу дозволяє приймати та видавати дані на відповідні шини комп'ютеру у будь-який момент часу майже без затримки, тобто швидкодія таких ЗП є достатньо високою. Додаткова перевага статичних ОЗП полягає в тому, що при читанні інформація не руйнується, тобто не потрібно втрачати час на її відновлення на відміну від динамічних ОЗП.
Найбільш суттєвим недоліком таких ЗП є їх відносна складність у виготовленні, особливо коли мова йде про ЗП з великою інформаційною ємністю. Неважко підрахувати, що для виготовлення найпростішого тригеру потрібні принаймні два транзистори, декілька резисторів навантаження і хоча б два конденсатори (запам’ятовуючий елемент сучасної статичної пам’яті має принаймні шість транзисторів). Тому статичні ЗП у якості основного ОЗП не використовують. Але висока швидкодія цих ЗП дозволила використовувати їх у якості буферних пристроїв пам'яті.Головне завдання їх полягає у узгодженні між собою пристроїв ЕОМ, які мають суттєву різницю у швидкодії. До речі, пристрій пам'яті, які виконує таку функцію отримав назву кеш-пам'яті.
Схематичне зображення мікросхеми ОЗП інформаційною ємністю Nx8 ілюструє рис. 5. Такий ОЗП припускає читання/запис 8-розрядного коду. Для запису 0 або 1, що надходять на входи DIO7- DIO0, потрібно на адресні входи подати код адреси, а на входи CS і W/R відповідно сигнали дозволу і читання/запису (1/0). Подача пасивного рівня на вхід ОЕ переводить мікросхему у так званий високоімпедансний стан (третій стан), тобто відключає від інформаційного обміну по шині даних. Таким чином процесор може здійснити читання/запис інформації із статичного ОЗП за два такти, що і обумовлює високо швидкодію пам’яті цього типу ( цикл звертання -- одиниці нс).
3. Оперативні запам’ятовувальні пристрої динамічного типу.
Елементарна комірка динамічної пам'яті (Dynamic RAM – DRAM) складається з одного конденсатора і замикаючого транзистора. Це дає можливість досягти набагато більшої щільності розміщення елементів і, у результаті, значно знизити вартість ОЗП. З іншого боку, дана технологія має ряд недоліків, головним з який є те, що заряд, що накопичується на конденсаторі, згодом губиться. Незважаючи на те, що при конструюванні конденсаторів комірки динамічної пам'яті використовується гарний діелектрик з електричним опором декілька тераОм (1012 Ом), заряд конденсатора губиться дуже швидко, тому що розміри одного конденсатора мікроскопічні, а ємність мізерна (порядку 10-15 Ф). При такій ємності на такому конденсаторі накопичується усього близько 40000 електронів! Середній час витоку заряду при сучасному дизайні комірок динамічної пам'яті складає сотні навіть десятки мілісекунд. Виходить, заряд кожного осередку потрібно відновлювати протягом даного відрізка часу, інакше інформація, що зберігається в пам'яті, буде загублена.
Порядок функціонування МС динамічної пам’яті
На відміну від SRAM адреса осередку DRAM передається в два кроки -- спочатку адреса стовпця, а потім і рядка. Це дає можливість знизити кількість виводів шини адреси приблизно вдвічі, за рахунок чого зменшити розміри корпуса і розмістити більшу кількість мікросхем на материнській платі. З іншого боку, це, безумовно, впливає на швидкодію, тому що для передачі адреси потрібно вдвічі більше часу.
Рядок масиву пам'яті також називають сторінкою пам'яті (Page). Для вказівки, яка саме частина адреси передається у визначений момент часу, служать два допоміжних сигнали - RAS (Row Address Strobe - строб рядка) і CAS (Column Address Strobe - строб стовпчика.
При звертанні до комірки пам'яті на шину адреси виставляється адреса рядка (Row). Після того як сигнал на шині стабілізувався, подається сигнал на лінію RAS, і адреса записується у внутрішній регістр мікросхеми пам'яті. Слідом за цим на шину адреси виставляють адресу стовпця, і видається сигнал CAS. Це, у залежності від стану ще однієї додаткової лінії - WE (Write Enable - дозвіл запису), приводить або до читання даних з осередку, або до їх запису. Інтервал між установкою адреси і видачею сигналу RAS (чи CAS) обумовлюється технічними характеристиками мікросхеми, але звичайно адреса виставляється в такті системної шини, а керуючий сигнал - у наступному. Таким чином, для читання чи запису однієї комірки пам'яті необхідно п'ять тактів (адреса рядка  RAS  адреса стовпця  CAS  операція читання/запис), у той час як SRAM вимагає всього два чи три такти.
Крім того, що конденсатор комірки пам'яті згодом втрачає заряд, операція читання також призводить до його втрати, тому після кожного читання дані повинні бути відновлені. Це досягається за рахунок повторного запису тих же даних відразу після читання. Якщо бути точним, то необхідний осередок вибирається тільки адресою рядка. А стовпці - це провідники, по яких дані записуються в осередок чи зчитуються з нього. При читанні одного осередку видаються дані відразу всього обраного рядка, але використовуються тільки ті, які знаходяться в потрібному для нас стовпці, а всі інші ігноруються. Таким чином, операція читання навіть одного осередку руйнує дані всього рядка, і їх потрібно відновлювати. Регенерація даних після читання виконується автоматично інтерфейсною логікою мікросхеми.
Тому що на читання першого біта інформації часто потрібен більший час, ніж для читання наступних, то звичайно для позначення швидкодії пам'яті використовують наступне позначення: х-у-у-у-у-.., де х - кількість тактів шини, необхідна для читання першого біта; у - для всіх наступних. У ПК досить часто відбувається читання чотирьох суміжних комірок пам'яті (це зв'язано із середньою довжиною команди процесора Pentium), тому багато типів пам'яті спеціально оптимизовані для даного режиму роботи, і в порівняльних характеристиках швидкодії звичайно приводиться тільки кількість циклів, необхідних для читання перших чотирьох комірок. Іншими словами, запис 3-1-1-1 говорить про те, що для читання першої комірки пам'яті необхідно 3 такти, а для читання наступних трьох - по одному.
ВИСНОВОК
Запам'ятовуючі пристрої (ЗП) є важливою частиною мікропроцесорних систем (МПС). Вони призначені для запису, зберігання та читання, або тільки для зберігання та читання інформації поданої у вигляді двійкових кодових слів.
За виконуваними функціями розрізняють такі типи ЗП:
•	оперативні запам'ятовуючі пристрої (ОЗП);
•	постійні запам'ятовуючі пристрої (ПЗП);
•	зовнішні запам'ятовуючі пристрої (ЗЗП).
Постійний запам'ятовуючий пристрій - це пам'ять комп'ютера, призначена для зберігання службових програм і даних, які не можуть бути змінені у процесі його роботи.
Зовнішня пам'ять може розглядатися як архівна пам'ять, призначена для довготермінового зберігання великих масивів інформації.
Оперативний запам'ятовуючий пристрій -- це пам'ять комп'ютера, призначена для зберігання даних, адрес та програм, які використовує комп'ютер в даний момент часу.
Розрізняють такі типи ОЗП:
•	статичні оперативні запам'ятовуючі пристрої (SRAM);
•	динамічні оперативні запам'ятовуючі пристрої (DRAM).
Оперативна пам’ять є енергозалежною, тобто інформація в ОЗП зникає після знеструмлення комп’ютера. Статичні ОЗП є найбільш швидкодіючими, але ж одночасно мають найбільшу питому вартість одиниці інформації, яка зберігається в них. Область використання статичних ОЗП – це швидкодіюча буферна пам’ять порівняно невеликих об’ємів. Динамічні ОЗП, за рахунок низької собівартості, займають основне місце в основній пам’яті і постійно вдосконалюються на технологічному, апаратному, архітектурному рівнях.
 

";
            textBox1.Text += Environment.NewLine + twelve + Environment.NewLine;
        }

        private void button15_Click(object sender, EventArgs e)
        {
            textBox1.Text = "";
            fifteen();
        }
        void fifteen()
        {
            string fifteen = @"Роз'єми
D-sub
D-subminiature, або D-sub - назва роз'єму, застосовуваного, зокрема, в комп'ютерній техніці. Назва *Субмініатюрний* було доречно тоді, коли ці роз'єми тільки з'явилися, в наш же час ці роз'єми відносяться до числу найбільших за розмірами з використовуваних в комп'ютерах. Роз'єм D-sub містить два або більше рядів контактів або гнізд, зазвичай оточених металевим екраном у формі латинської D, що захищає від електромагнітних завад. Форма роз'єму в вигляді літери D оберігає від неправильної орієнтації роз'єму. Частина роз'єму, містить контакти, називається по-англійськи male connector, або plug (по-російськи штекер, або вилка, хоча частіше в даному контексті використовується жаргонний термін *тато*), а частина, містить гнізда - female connector, або socket (розетка або *мама*). екран розетки щільно входить всередину екрану вилки. Якщо використовуються кабелі, екрани роз'ємів з'єднуються з екранами кабелів, забезпечуючи, таким чином, безперервне екранування для всього з'єднання.
Конструктивно роз'єми D-sub існують, щонайменше, чотирьох типів, що розрізняються способом приєднання проводів до контактів. Ці способи включають в себе пайку, проколювання ізоляції, обтиск і припайку до друкованої плати. Паяні контакти використовують порожнини, куди вставляються очищені від ізоляції проводу та вручну паяються. При проколюванні ізоляції кабель вставляється в затискачі і одночасно проколюються всі дроти. Це дуже швидкий спосіб збирання, але вимагає використання плоского кабелю, який не завжди зручний. При обтиску очищені від ізоляції контакти вставляються в порожнині на задній частині контакту, ці порожнини стискаються спеціальним обтискним інструментом, після чого контакт вставляється в роз'єм. Такий спосіб кріплення зручний в ситуаціях, коли будь-який контакт пошкоджений, або необхідно провести модифікації в схемі. При пайці до друкованої плати підходящі до контактів проводки зазвичай згинають під прямим кутом, так, щоб кабель можна було б підключати паралельно платі. Конструкції, що містять припаяні таким чином D раз'єми, зазвичай є на материнських платах стандарту ATX, крім цього зустрічаються рідко.
Роз'єми вдвічі меншого, ніж D-sub, розміру іменуються Microminiature D, або micro-D; ця назва є торговою маркою ITT Canon. Цей роз'єм використовується в промисловості. Деякі виробники випускають також nano-D роз'єми, які менше ще в два рази.

DVI
Digital Visual Interface, скор. DVI (англ. Цифровий відеоінтерфейс) - роз'єм, призначений для передачі відеозображення на цифрові пристрої відображення, такі як рідкокристалічні монітори і проектори. Розроблено консорціумом Digital Display Working Group. Попередні стандарти відеороз'ємів, наприклад, VGA -аналогові і спочатку були призначені для моніторів на електронно-променевих трубках (ЕПТ). Вони передають сигнал через підрядник, при цьому зміна напруги означає зміна яскравості. Для пристроїв на ЕПТ це було потрібно для зміни інтенсивності потоку електронів.
Формат даних, що використовується в DVI, заснований на PanelLink - форматі послідовної передачі даних, розробленому фірмою Silicon Image. Він використовує Transition Minimized Differential Signaling (англ. - диференціальна передача сигналів з мінімізацією перепадів рівнів) або TMDS. Single link DVI складається з чотирьох кручених пар (червоний, зелений, синій, і clock) щоб передавати 24 біта на піксель. C Single link DVI, може бути досягнуто максимальне можливе дозвіл 2,6 мегапікселя при 60 Гц.
Існує 3 види:
DVI-A - тільки аналогова передача
DVI-I - аналогова і цифрова передача
DVI-D - тільки цифрова передача
Цифрова передача
• Мінімальна тактова частота: 21,76 МГц
• Максимальна тактова частота в одинарному режимі: 165 МГц
• Максимальна тактова частота в подвійному режимі: Обмежується тільки кабелем
• Передається пікселів за такт: 1 (одинарний режим) або 2 (подвійний)
• Бітов в пікселі: 24
• Приклади режимів (single link):
o HDTV (1920 × 1080) частота 60 Гц з 5% LCD blanking (131 МГц)
o 1920 x 1200 частота 60 Гц (154 МГц)
o UXGA (1600 × 1200) частота 60 Гц with GTF blanking (161 МГц)
o SXGA (1280 × 1024) частота 85 Гц with GTF blanking (159 МГц)
• Приклади режимів (dual link):
o QXGA (2048 × 1536) або менших частота 75 Гц with GTF blanking (2 × 170 МГц)
o HDTV (1920 × 1080) частота 85 Гц with GTF blanking (2 × 126 МГц)
o 2560 × 1600 pixels (на 30-дюймовому РК-дисплеї
Аналогова передача
• Пропускна здатність RGB-сигналу: 400 МГц (-3 dB)
Однією з найпоширеніших проблем є поява розкиданих і мерехтливих червоних (хоча можливі й інші кольори) точок на високій роздільній здатності на зображенні, це може відбуватися з таких причин:
• Недостатній контакт кількох пінів кабелю
• Брак швидкості передачі по кабелю
• Погана перешкодозахищеність кабелю
Способи усунення:
• поліпшити фіксацію кабелю в гніздах шляхом закрутки гвинтів на качанах
• Замінити кабель на DVI Dual link, тим самим збільшивши швидкість передачі
• Замінити на більш перешкодозахищеність кабель, проте треба пам'ятати, що швидкості
кабелю Single Link на високій роздільній здатності може не вистачити
А також альтернативні способи усунення:
• Знизити частоту оновлення драйвера відеоадаптера
• Переключити режим роботи DVI (наприклад як в драйверах відеокарт ATI Catalyst)
DFP
Попередній DVI інтерфейс Digital Flat Panel був розроблений організацією VESA. DFP розрахований на той же самий тип цифрового сигналу (TMDS), що і DVI, але аналоговий сигнал передавати не може. На відеокарті розташовується роз'єм *мама*, на кабелі монітора - *тато*

ADC
Apple Display Connector - модифікація роз'єму DVI, яка об'єднує в одному кабелі відеосигнали (аналогові і цифрові), USB і живлення. ADC застосовувався фірмою Apple в старих розробках. На новіших моделях вже використовується стандартний DVI-роз'єм. На відеокарті розташовується роз'єм *мама*, на кабелі монітора - *тато*.

VGA
Video Graphics Array - інтерфейс, розроблений в 1987 році корпорацією IBM. У 1989 році організацією Video Electronics Standards Association (VESA) прийнятий стандарт SVGA.
Сучасна версія інтерфейсу значно перевершує за своїми можливостями початковий стандарт. Для позначення розширених можливостей інтерфейсувикористовуються наступні назви
S-Video
S-Video (Separate Video) - роздільні сигнали Y (яскравість c кадрової і рядкової синхронізацією) і С (кольоровість з синхронізацією на частоті,), передаються по двох лініях зв'язку і забезпечують кращу якість зображення, так як при цьому виключаються похибки селекції сигналу кольоровості з композитного, необхідної для їх обробки і декодування.
Аналоговий роз'єм S-Video (Separate Video), в народі часто іменований (абсолютно некоректно!) S-VHS, застосовується в основному для виведення комп'ютерного зображення на побутові телевізори та іншу домашню відеотехніку. Істотним недоліком цього інтерфейсу (при використанні в відеоадаптерах) є те, що в сучасних відкритих можуть використовуватися кілька варіантів роз'єму S-Video, з різною кількістю контактів і не завжди сумісних один з одним

";
            textBox1.Text += Environment.NewLine + fifteen + Environment.NewLine;
        }

        private void button16_Click(object sender, EventArgs e)
        {

            textBox1.Text = "";
            fourteen();
        }
        void fourteen()
        {
            string fourteen = @"1.	Відеоадаптер: принципи роботи, пристрої, технічні характеристики.
Графічна плата (відома також як графічна карта, відеокарта, відеоадаптер) (Англ. Videocard) - пристрій, що перетворює зображення, що знаходиться в пам'яті комп'ютера, у відеосигнал для монітора. Зазвичай відеокарта є платою розширення і вставляється в спеціальний роз'єм (ISA, VLB, PCI, AGP, PCI-Express) для відеокарт на материнській платі, але буває і вбудованої.
Сучасні відеокарти не обмежуються простим виведенням зображення, вони мають вбудований мікропроцесор, який може виробляти додаткову обробку, розвантажуючи від цих завдань центральний процесор комп'ютера.
Одним з перших графічних адаптерів для IBM PC стала плата MDA (Monochrome Display Adapter) в 1981 році, яка працювала тільки в текстовому режимі з роздільною здатністю 25х80 символів (фізично 720x350 точок) і мала п'ять атрибутів тексту - звичайний, яскравий, інверсний, підкреслений і миготливий. Ніякої колірної або графічної інформації він передавати не міг, і те, якого кольору будуть літери, визначалося моделлю використовуваного монітора, зазвичай вони були чорно-білими, бурштиновими або смарагдовими. Фірма Hercules в 1982 році випустила подальший розвиток адаптера MDA, відеоадаптер HGC (Hercules Graphics Controller - графічний адаптер Геркулес), який мав роздільну здатність 720х348 точок і підтримував дві графічні сторінки. Але він все ще не дозволяв працювати з кольором.
Першою кольоровою графічною платою стала CGA (Color Graphics Adapter), випущена IBM і стала основою для подальших стандартів відеокарт. Вона могла працювати або в текстовому режимі з роздільною здатністю 40x25 і 80x25 (матриця символу - 8x8), або в графічному з роздільною здатністю 320x200 чи 640x200. У текстових режимах доступно 256 атрибутів символу - 16 кольорів символу і 16 кольорів фону (або 8 кольорів фону і атрибут миготіння), в графічному режимі 320x200 було доступно чотири палітри по чотири кольори  кожна, режим високого дозволу 640x200 був монохромний. У розвиток цієї карти з'явився EGA (Enhanced Graphics Adapter) - поліпшений графічний адаптер, з роздільною здатністю до 64 кольорів палітрою, і проміжним буфером. Була покращена роздільна здатність до 640x350, в результаті додався текстовий режим 80x43 при матриці символу 8x8. Для режиму 80x25 використовувалася велика матриця - 8x14, одночасно можна було використовувати 16 кольорів, колірна палітра була розширена до 64 кольорів. Графічний режим так само дозволяв використовувати при роздільній здатності 640x350 16 кольорів з палітри в 64 кольори. Був сумісний з CGA і MDA.
З 1991 року з'явилося поняття SVGA (Super VGA - «понад» VGA) - розширення VGA з додаванням більш високих режимів і додаткового сервісу, наприклад можливості поставити довільну частоту кадрів. Число одночасно відображуваних кольрів збільшується до 65536 (High Color) і 16.7 млн. (True Color), з'являються додаткові текстові режими. З сервісних функцій з'являється підтримка VBE (VESA BIOS Extention - розширення БІОС стандарту VESA). SVGA сприймається як фактичний стандарт відеоадаптера десь з середини 1992 року, після прийняття асоціацією VESA (Video Electronics Standart Association - асоціація стандартизації відео-електроніки) стандарту VBE версії 1.0. До того моменту практично всі відеоадаптери SVGA були несумісні між собою.
Графічний користувальницький інтерфейс, що з'явився в багатьох операційних системах, стимулював новий етап розвитку відеоадаптерів. з'являється поняття «Графічний прискорювач» (graphics accelerator). Це відеоадаптери, які здійснюють виконання деяких графічних функцій на апаратному рівні. До числа цих функцій відносяться, переміщення великих блоків зображення з однієї ділянки екрану в інший (Наприклад при переміщенні вікна), заливання ділянок зображення, малювання ліній, дуг, шрифтів, підтримка апаратного курсора і т. п. Прямим поштовхом до розвитку настільки спеціалізованого пристрою стало те, що графічний користувальницький інтерфейс безсумнівно зручний, але його використання вимагає від центрального процесора чималих обчислювальних ресурсів, і сучасний графічний прискорювач якраз і покликаний зняти з нього левову частку обчислень для остаточного виводу зображення на екран.
Основні компоненти графічної плати
• Графічний процесор (GPU) - займається розрахунками зображення, що виводиться, звільняючи від цього обов'язку центральний процесор, проводить розрахунки для обробки команд тривимірної графіки. Є основою графічної плати, саме від нього залежать швидкодія і можливості всього пристрою. Сучасні графічні процесори по складності мало чим поступаються центральному процесора комп'ютера, і часто перевершують їх за кількістю транзисторів. Архітектура сучасного GPU звичайно припускає наявність декількох блоків обробки інформації, а саме: блок обробки 2D графіки, блок обробки 3D графіки, в свою чергу, зазвичай розділяється на геометричне ядро (плюс кеш вершин) і блок растеризації (плюс кеш текстур) і ін.
Видеоконтроллер - відповідає за формування зображення в відеопам'яті, дає команди RAMDAC на формування сигналів розгортки для монітора і здійснює обробку запитів центрального процесора. Крім цього, зазвичай присутні контролер зовнішньої шини даних (наприклад PCI або AGP), контролер внутрішньої шини даних і контроллер відеопам'яті. Ширина внутрішньої шини і шини відеопам'яті зазвичай ширше зовнішньої (64, 128 або 256 розрядів проти 16 або 32), в багато відеоконтролерів вбудовується ще і RAMDAC. Сучасні графічні адаптери (ATI, nVidia) зазвичай мають не менше двох видеоконтроллеров, що працюють незалежно один від одного і керуючих одночасно одним або декількома дисплеями кожен.
Відеопам'ять - виконує роль кадрового буфера, в якому зберігається в цифровому форматі зображення, що генерується і постійно змінюване графічним процесором і що виводиться на екран монітора (або декількох моніторів). В відеопам'яті зберігаються також проміжні невидимі на екрані елементи зображення та інші дані. Відеопам'ять буває декількох типів, розрізняються за швидкістю доступу і робочій частоті. Сучасні відеокарти комплектуються пам'яттю типу DDR, DDR2 або GDDR3. Слід також мати на увазі, що крім відеопам'яті, що знаходиться на відеокарті, сучасні графічні процесори зазвичай використовують у своїй роботі частину загальної системної пам'яті комп'ютера, прямий доступ до якої організовується драйвером відеоадаптера через шину AGP або PCIE.
Цифро-аналоговий перетворювач ЦАП (RAMDAC) - служить для перетворення зображення, формованого видеоконтроллером, в рівні інтенсивності кольору, що подаються на аналоговий монітор. Можливий діапазон кольоровості зображення визначається тільки параметрами RAMDAC. Найчастіше RAMDAC має чотири основні блоки - три цифроаналогових перетворювача, по одному на кожен колірний канал (червоний, синій, зелений, RGB), і SRAM для зберігання даних про гамма корекції. Більшість ЦАП мають розрядність 8 біт на канал – виходить по 256 рівнів яскравості на кожен основний колір, що в сумі дає 16.7 млн. кольорів (і за рахунок гамма корекції є можливість відображати вихідні 16.7 млн. кольорів в набагато більшому кольоровому простір). Деякі RAMDAC мають розрядність по кожному каналу 10bit (1024 рівня яскравості), що дозволяє відразу відображати більше 1 млрд. кольорів, але ця можливість практично не використовується. Для підтримки другого монітора часто встановлюють другий ЦАП. Варто відзначити, що монітори і відеопроектори що підключаються до цифрового DVI виходу відеокарти для перетворення потоку цифрових даних використовують власні цифроаналогові перетворювачі і від характеристик ЦАП відеокарти не залежать.
Відео-ПЗУ (Video ROM) - постійний запам'ятовуючий пристрій, в якому записані відео-BIOS, екранні шрифти, службові таблиці і т. п. ПЗУ не використовується відеоконтроллером безпосередньо - до нього звертається лише центральний процесор. Зберігаєме в ПЗУ відео-BIOS забезпечує ініціалізацію і роботу відеокарти до завантаження основної операційної системи, а також містить системні дані, які можуть читатися і інтерпретуватися відеодрайвером в процесі роботи (в залежності від застосовуваного методу поділу відповідальності між драйвером і BIOS). На багатьох сучасних картах встановлюються електрично перепрограмовані ПЗП (EEРROM, Flash ROM), що допускають перезапис відео-BIOS самим користувачем за допомогою спеціальної програми.
• Система охолодження - призначена для збереження температурного режиму відеопроцесора і відеопам'яті в допустимих значеннях.
Шини
AGP
AGP (від англ. Accelerated Graphics Port, прискорений графічний порт) – розроблена в 1997 році компанією Intel, спеціалізована 32-бітна системна шина для відеокарти. З'явилася одночасно з чіпсетами для процесора Intel Pentium II. Основним завданням розробників було збільшення продуктивності і зменшення вартості відеокарти, за рахунок зменшення кількості вбудованої відеопам'яті. За задумом Intel великі обсяги відеопам'яті для AGP-карт були б не потрібні, оскільки технологія передбачала високошвидкісний доступ до загальної пам'яті.
Відмінності від попередньої шини PCI:
• робота на тактовій частоті 66 МГц;
• збільшена пропускна здатність;
• режим роботи з пам'яттю DMA і DME;
• поділ запитів на операцію і передачу даних.
Перша версія (специфікація AGP 1.0) AGP 1x використовується рідко, оскільки не забезпечує необхідної швидкості роботи з пам'яттю в режимі DME, відразу ж при проектуванні була додана можливість посилати 2 блоки даних за один такт, це AGP 2x. У 1998 році вийшла друга версія (специфікація AGP 2.0) - AGP 4x, яка могла пересилати вже 4 блоки за один такт і забезпечувала швидкість обміну близько 1Гб / с. Рівень напруги замість звичайних 3,3 В був знижений до 1,5 В. Шина AGP 8x (Специфікація AGP 3.0) передає вже 8 блоків за один такт, таким чином, швидкість передачі даних досягає 2 Гб / с. Також в стандарті була закладена можливість використання двох відеокарт (аналогічно ATI CrossFire, Nvidia SLI), проте ця можливість не була використана виробниками. Сучасні відеокарти вимагають великої потужності, понад 40 Ватт, яку шина AGP дати не може, так з'явилася специфікація AGP Pro з додатковими роз'ємами живлення.
Доступ до пам'яті
• DMA (Direct Memory Access) - доступ до пам'яті, в цьому режимі основною пам'яттю вважається вбудована відеопам'ять на карті, текстури копіюються туди перед використанням з системної пам'яті комп'ютера. Цей режим роботи не був новим, за тим же принципом працюють звукові карти, деякі контролери і т. п. 
• DME (Direct in Memory Execute) - в цьому режимі основна і відеопам'ять перебувають як би в загальному адресному просторі. Спільний простір емулюється за допомогою таблиці відображення адрес GART (Graphic Address Remapping Table) блоками по 4КБ. Таким чином копіювати дані з основної пам'яті в відеопам'ять вже не потрібно, цей процес називають AGP-текстурування.
Роз'єми AGP і слоти пов'язані ключем, щоб визначати сигналізуючу напругу, на якій здатний функціонувати пристрій. AGP має два ключа: ключ 3.3V і ключ 1.5V. На жаль було додано третій напруга, 0.8V. Якщо пристрій діє в 0.8V, воно використовує ключ 1.5V і має витримувати 1.5V. Ключі фізично охороняють електрично несумісні відеокарти AGP від включення в слот. Якщо пристрій має 1.5V-ключ працює на швидкості 8x, то це означає, що його робоча напруга 0.8V.
AGP Pro - це розширення звичайного AGP- роз'єму, що дозволяє подавати на пристрій велику потужність (50-100 Вт, замість 20-50 Вт). Відеокарта з таким роз'єми не буде працювати в звичайному AGP.
";
            textBox1.Text += Environment.NewLine + fourteen + Environment.NewLine;
        }

        private void button17_Click(object sender, EventArgs e)
        {

            textBox1.Text = "";
            threeteen();
        }
        void threeteen()
        {
            string threeteen = @"
";
            textBox1.Text += Environment.NewLine + threeteen + Environment.NewLine;
        }

        private void button19_Click(object sender, EventArgs e)
        {

            textBox1.Text = "";
            sixteen();
        }
        void sixteen()
        {
            string sixteen = @"
";
            textBox1.Text += Environment.NewLine + sixteen + Environment.NewLine;
        }

     

        private void button20_Click(object sender, EventArgs e)
        {

        }

        

        private void button20_Click_1(object sender, EventArgs e)
        {            
            if (comboBox1.SelectedItem.ToString() == "10")
            {
                Font myfont = new Font("Times New Roman", 10.0f);
                textBox1.Font = myfont;
            }
            if (comboBox1.SelectedItem.ToString() == "11")
            {
                Font myfont = new Font("Times New Roman", 11.0f);
                textBox1.Font = myfont;
            }
            if (comboBox1.SelectedItem.ToString() == "12")
                {
                    Font myfont = new Font("Times New Roman", 12.0f);
                    textBox1.Font = myfont;
                }            
            if (comboBox1.SelectedItem.ToString() == "14")
            {
                Font myfont = new Font("Times New Roman", 14.0f);
                textBox1.Font = myfont;
            }
            if (comboBox1.SelectedItem.ToString() == "16")
            {
                Font myfont = new Font("Times New Roman", 16.0f);
                textBox1.Font = myfont;
            }
            if (comboBox1.SelectedItem.ToString() == "18")
            {
                Font myfont = new Font("Times New Roman", 18.0f);
                textBox1.Font = myfont;
            }
            if (comboBox1.SelectedItem.ToString() == "20")
            {
                Font myfont = new Font("Times New Roman", 20.0f);
                textBox1.Font = myfont;
            }
            
        }

        private void button21_Click(object sender, EventArgs e)
        {
            Form1 ppp = new Form1();
            ppp.Show();
            this.Close();

        }
    }
    }

